GopalSaraf/Practicals/PSDL/include/proc/pic16lf1773.inc
// Register: PIE4
#define PIE4 PIE4
PIE4                                     equ 0094h
// bitfield definitions
PIE4_TMR4IE_POSN                         equ 0000h
PIE4_TMR4IE_POSITION                     equ 0000h
PIE4_TMR4IE_SIZE                         equ 0001h
PIE4_TMR4IE_LENGTH                       equ 0001h
PIE4_TMR4IE_MASK                         equ 0001h
PIE4_TMR6IE_POSN                         equ 0001h
PIE4_TMR6IE_POSITION                     equ 0001h
PIE4_TMR6IE_SIZE                         equ 0001h
PIE4_TMR6IE_LENGTH                       equ 0001h
PIE4_TMR6IE_MASK                         equ 0002h
PIE4_TMR3IE_POSN                         equ 0002h
PIE4_TMR3IE_POSITION                     equ 0002h
PIE4_TMR3IE_SIZE                         equ 0001h
PIE4_TMR3IE_LENGTH                       equ 0001h
PIE4_TMR3IE_MASK                         equ 0004h
PIE4_TMR3GIE_POSN                        equ 0003h
PIE4_TMR3GIE_POSITION                    equ 0003h
PIE4_TMR3GIE_SIZE                        equ 0001h
PIE4_TMR3GIE_LENGTH                      equ 0001h
PIE4_TMR3GIE_MASK                        equ 0008h
PIE4_TMR5IE_POSN                         equ 0004h
PIE4_TMR5IE_POSITION                     equ 0004h
PIE4_TMR5IE_SIZE                         equ 0001h
PIE4_TMR5IE_LENGTH                       equ 0001h
PIE4_TMR5IE_MASK                         equ 0010h
PIE4_TMR5GIE_POSN                        equ 0005h
PIE4_TMR5GIE_POSITION                    equ 0005h
PIE4_TMR5GIE_SIZE                        equ 0001h
PIE4_TMR5GIE_LENGTH                      equ 0001h
PIE4_TMR5GIE_MASK                        equ 0020h
PIE4_TMR8IE_POSN                         equ 0006h
PIE4_TMR8IE_POSITION                     equ 0006h
PIE4_TMR8IE_SIZE                         equ 0001h
PIE4_TMR8IE_LENGTH                       equ 0001h
PIE4_TMR8IE_MASK                         equ 0040h

// Register: PIE5
#define PIE5 PIE5
PIE5                                     equ 0095h
// bitfield definitions
PIE5_C5IE_POSN                           equ 0000h
PIE5_C5IE_POSITION                       equ 0000h
PIE5_C5IE_SIZE                           equ 0001h
PIE5_C5IE_LENGTH                         equ 0001h
PIE5_C5IE_MASK                           equ 0001h
PIE5_C6IE_POSN                           equ 0001h
PIE5_C6IE_POSITION                       equ 0001h
PIE5_C6IE_SIZE                           equ 0001h
PIE5_C6IE_LENGTH                         equ 0001h
PIE5_C6IE_MASK                           equ 0002h
PIE5_COG3IE_POSN                         equ 0004h
PIE5_COG3IE_POSITION                     equ 0004h
PIE5_COG3IE_SIZE                         equ 0001h
PIE5_COG3IE_LENGTH                       equ 0001h
PIE5_COG3IE_MASK                         equ 0010h
PIE5_CCP7IE_POSN                         equ 0006h
PIE5_CCP7IE_POSITION                     equ 0006h
PIE5_CCP7IE_SIZE                         equ 0001h
PIE5_CCP7IE_LENGTH                       equ 0001h
PIE5_CCP7IE_MASK                         equ 0040h

// Register: PIE6
#define PIE6 PIE6
PIE6                                     equ 0096h
// bitfield definitions
PIE6_PWM5IE_POSN                         equ 0000h
PIE6_PWM5IE_POSITION                     equ 0000h
PIE6_PWM5IE_SIZE                         equ 0001h
PIE6_PWM5IE_LENGTH                       equ 0001h
PIE6_PWM5IE_MASK                         equ 0001h
PIE6_PWM6IE_POSN                         equ 0001h
PIE6_PWM6IE_POSITION                     equ 0001h
PIE6_PWM6IE_SIZE                         equ 0001h
PIE6_PWM6IE_LENGTH                       equ 0001h
PIE6_PWM6IE_MASK                         equ 0002h
PIE6_PWM11IE_POSN                        equ 0002h
PIE6_PWM11IE_POSITION                    equ 0002h
PIE6_PWM11IE_SIZE                        equ 0001h
PIE6_PWM11IE_LENGTH                      equ 0001h
PIE6_PWM11IE_MASK                        equ 0004h

// Register: OPTION_REG
#define OPTION_REG OPTION_REG
OPTION_REG                               equ 0097h
// bitfield definitions
OPTION_REG_PS_POSN                       equ 0000h
OPTION_REG_PS_POSITION                   equ 0000h
OPTION_REG_PS_SIZE                       equ 0003h
OPTION_REG_PS_LENGTH                     equ 0003h
OPTION_REG_PS_MASK                       equ 0007h
OPTION_REG_PSA_POSN                      equ 0003h
OPTION_REG_PSA_POSITION                  equ 0003h
OPTION_REG_PSA_SIZE                      equ 0001h
OPTION_REG_PSA_LENGTH                    equ 0001h
OPTION_REG_PSA_MASK                      equ 0008h
OPTION_REG_TMR0SE_POSN                   equ 0004h
OPTION_REG_TMR0SE_POSITION               equ 0004h
OPTION_REG_TMR0SE_SIZE                   equ 0001h
OPTION_REG_TMR0SE_LENGTH                 equ 0001h
OPTION_REG_TMR0SE_MASK                   equ 0010h
OPTION_REG_TMR0CS_POSN                   equ 0005h
OPTION_REG_TMR0CS_POSITION               equ 0005h
OPTION_REG_TMR0CS_SIZE                   equ 0001h
OPTION_REG_TMR0CS_LENGTH                 equ 0001h
OPTION_REG_TMR0CS_MASK                   equ 0020h
OPTION_REG_INTEDG_POSN                   equ 0006h
OPTION_REG_INTEDG_POSITION               equ 0006h
OPTION_REG_INTEDG_SIZE                   equ 0001h
OPTION_REG_INTEDG_LENGTH                 equ 0001h
OPTION_REG_INTEDG_MASK                   equ 0040h
OPTION_REG_nWPUEN_POSN                   equ 0007h
OPTION_REG_nWPUEN_POSITION               equ 0007h
OPTION_REG_nWPUEN_SIZE                   equ 0001h
OPTION_REG_nWPUEN_LENGTH                 equ 0001h
OPTION_REG_nWPUEN_MASK                   equ 0080h
OPTION_REG_PS0_POSN                      equ 0000h
OPTION_REG_PS0_POSITION                  equ 0000h
OPTION_REG_PS0_SIZE                      equ 0001h
OPTION_REG_PS0_LENGTH                    equ 0001h
OPTION_REG_PS0_MASK                      equ 0001h
OPTION_REG_PS1_POSN                      equ 0001h
OPTION_REG_PS1_POSITION                  equ 0001h
OPTION_REG_PS1_SIZE                      equ 0001h
OPTION_REG_PS1_LENGTH                    equ 0001h
OPTION_REG_PS1_MASK                      equ 0002h
OPTION_REG_PS2_POSN                      equ 0002h
OPTION_REG_PS2_POSITION                  equ 0002h
OPTION_REG_PS2_SIZE                      equ 0001h
OPTION_REG_PS2_LENGTH                    equ 0001h
OPTION_REG_PS2_MASK                      equ 0004h
OPTION_REG_T0SE_POSN                     equ 0004h
OPTION_REG_T0SE_POSITION                 equ 0004h
OPTION_REG_T0SE_SIZE                     equ 0001h
OPTION_REG_T0SE_LENGTH                   equ 0001h
OPTION_REG_T0SE_MASK                     equ 0010h
OPTION_REG_T0CS_POSN                     equ 0005h
OPTION_REG_T0CS_POSITION                 equ 0005h
OPTION_REG_T0CS_SIZE                     equ 0001h
OPTION_REG_T0CS_LENGTH                   equ 0001h
OPTION_REG_T0CS_MASK                     equ 0020h

// Register: PCON
#define PCON PCON
PCON                                     equ 0098h
// bitfield definitions
PCON_nBOR_POSN                           equ 0000h
PCON_nBOR_POSITION                       equ 0000h
PCON_nBOR_SIZE                           equ 0001h
PCON_nBOR_LENGTH                         equ 0001h
PCON_nBOR_MASK                           equ 0001h
PCON_nPOR_POSN                           equ 0001h
PCON_nPOR_POSITION                       equ 0001h
PCON_nPOR_SIZE                           equ 0001h
PCON_nPOR_LENGTH                         equ 0001h
PCON_nPOR_MASK                           equ 0002h
PCON_nRI_POSN                            equ 0002h
PCON_nRI_POSITION                        equ 0002h
PCON_nRI_SIZE                            equ 0001h
PCON_nRI_LENGTH                          equ 0001h
PCON_nRI_MASK                            equ 0004h
PCON_nRMCLR_POSN                         equ 0003h
PCON_nRMCLR_POSITION                     equ 0003h
PCON_nRMCLR_SIZE                         equ 0001h
PCON_nRMCLR_LENGTH                       equ 0001h
PCON_nRMCLR_MASK                         equ 0008h
PCON_nRWDT_POSN                          equ 0004h
PCON_nRWDT_POSITION                      equ 0004h
PCON_nRWDT_SIZE                          equ 0001h
PCON_nRWDT_LENGTH                        equ 0001h
PCON_nRWDT_MASK                          equ 0010h
PCON_STKUNF_POSN                         equ 0006h
PCON_STKUNF_POSITION                     equ 0006h
PCON_STKUNF_SIZE                         equ 0001h
PCON_STKUNF_LENGTH                       equ 0001h
PCON_STKUNF_MASK                         equ 0040h
PCON_STKOVF_POSN                         equ 0007h
PCON_STKOVF_POSITION                     equ 0007h
PCON_STKOVF_SIZE                         equ 0001h
PCON_STKOVF_LENGTH                       equ 0001h
PCON_STKOVF_MASK                         equ 0080h

// Register: WDTCON
#define WDTCON WDTCON
WDTCON                                   equ 0099h
// bitfield definitions
WDTCON_SWDTEN_POSN                       equ 0000h
WDTCON_SWDTEN_POSITION                   equ 0000h
WDTCON_SWDTEN_SIZE                       equ 0001h
WDTCON_SWDTEN_LENGTH                     equ 0001h
WDTCON_SWDTEN_MASK                       equ 0001h
WDTCON_WDTPS_POSN                        equ 0001h
WDTCON_WDTPS_POSITION                    equ 0001h
WDTCON_WDTPS_SIZE                        equ 0005h
WDTCON_WDTPS_LENGTH                      equ 0005h
WDTCON_WDTPS_MASK                        equ 003Eh
WDTCON_WDTPS0_POSN                       equ 0001h
WDTCON_WDTPS0_POSITION                   equ 0001h
WDTCON_WDTPS0_SIZE                       equ 0001h
WDTCON_WDTPS0_LENGTH                     equ 0001h
WDTCON_WDTPS0_MASK                       equ 0002h
WDTCON_WDTPS1_POSN                       equ 0002h
WDTCON_WDTPS1_POSITION                   equ 0002h
WDTCON_WDTPS1_SIZE                       equ 0001h
WDTCON_WDTPS1_LENGTH                     equ 0001h
WDTCON_WDTPS1_MASK                       equ 0004h
WDTCON_WDTPS2_POSN                       equ 0003h
WDTCON_WDTPS2_POSITION                   equ 0003h
WDTCON_WDTPS2_SIZE                       equ 0001h
WDTCON_WDTPS2_LENGTH                     equ 0001h
WDTCON_WDTPS2_MASK                       equ 0008h
WDTCON_WDTPS3_POSN                       equ 0004h
WDTCON_WDTPS3_POSITION                   equ 0004h
WDTCON_WDTPS3_SIZE                       equ 0001h
WDTCON_WDTPS3_LENGTH                     equ 0001h
WDTCON_WDTPS3_MASK                       equ 0010h
WDTCON_WDTPS4_POSN                       equ 0005h
WDTCON_WDTPS4_POSITION                   equ 0005h
WDTCON_WDTPS4_SIZE                       equ 0001h
WDTCON_WDTPS4_LENGTH                     equ 0001h
WDTCON_WDTPS4_MASK                       equ 0020h

