GopalSaraf/Practicals/PSDL/include/proc/pic16lf1773.inc
// Register: PWM4CON
#define PWM4CON PWM4CON
PWM4CON                                  equ 0619h
// bitfield definitions
PWM4CON_POL_POSN                         equ 0004h
PWM4CON_POL_POSITION                     equ 0004h
PWM4CON_POL_SIZE                         equ 0001h
PWM4CON_POL_LENGTH                       equ 0001h
PWM4CON_POL_MASK                         equ 0010h
PWM4CON_OUT_POSN                         equ 0005h
PWM4CON_OUT_POSITION                     equ 0005h
PWM4CON_OUT_SIZE                         equ 0001h
PWM4CON_OUT_LENGTH                       equ 0001h
PWM4CON_OUT_MASK                         equ 0020h
PWM4CON_EN_POSN                          equ 0007h
PWM4CON_EN_POSITION                      equ 0007h
PWM4CON_EN_SIZE                          equ 0001h
PWM4CON_EN_LENGTH                        equ 0001h
PWM4CON_EN_MASK                          equ 0080h
PWM4CON_PWM4POL_POSN                     equ 0004h
PWM4CON_PWM4POL_POSITION                 equ 0004h
PWM4CON_PWM4POL_SIZE                     equ 0001h
PWM4CON_PWM4POL_LENGTH                   equ 0001h
PWM4CON_PWM4POL_MASK                     equ 0010h
PWM4CON_PWM4OUT_POSN                     equ 0005h
PWM4CON_PWM4OUT_POSITION                 equ 0005h
PWM4CON_PWM4OUT_SIZE                     equ 0001h
PWM4CON_PWM4OUT_LENGTH                   equ 0001h
PWM4CON_PWM4OUT_MASK                     equ 0020h
PWM4CON_PWM4EN_POSN                      equ 0007h
PWM4CON_PWM4EN_POSITION                  equ 0007h
PWM4CON_PWM4EN_SIZE                      equ 0001h
PWM4CON_PWM4EN_LENGTH                    equ 0001h
PWM4CON_PWM4EN_MASK                      equ 0080h

// Register: PWM9DCL
#define PWM9DCL PWM9DCL
PWM9DCL                                  equ 061Ah
// bitfield definitions
PWM9DCL_DC_POSN                          equ 0006h
PWM9DCL_DC_POSITION                      equ 0006h
PWM9DCL_DC_SIZE                          equ 0002h
PWM9DCL_DC_LENGTH                        equ 0002h
PWM9DCL_DC_MASK                          equ 00C0h
PWM9DCL_DC0_POSN                         equ 0006h
PWM9DCL_DC0_POSITION                     equ 0006h
PWM9DCL_DC0_SIZE                         equ 0001h
PWM9DCL_DC0_LENGTH                       equ 0001h
PWM9DCL_DC0_MASK                         equ 0040h
PWM9DCL_DC1_POSN                         equ 0007h
PWM9DCL_DC1_POSITION                     equ 0007h
PWM9DCL_DC1_SIZE                         equ 0001h
PWM9DCL_DC1_LENGTH                       equ 0001h
PWM9DCL_DC1_MASK                         equ 0080h
PWM9DCL_PWM9DC0_POSN                     equ 0006h
PWM9DCL_PWM9DC0_POSITION                 equ 0006h
PWM9DCL_PWM9DC0_SIZE                     equ 0001h
PWM9DCL_PWM9DC0_LENGTH                   equ 0001h
PWM9DCL_PWM9DC0_MASK                     equ 0040h
PWM9DCL_PWM9DC1_POSN                     equ 0007h
PWM9DCL_PWM9DC1_POSITION                 equ 0007h
PWM9DCL_PWM9DC1_SIZE                     equ 0001h
PWM9DCL_PWM9DC1_LENGTH                   equ 0001h
PWM9DCL_PWM9DC1_MASK                     equ 0080h
PWM9DCL_PWMPW0_POSN                      equ 0006h
PWM9DCL_PWMPW0_POSITION                  equ 0006h
PWM9DCL_PWMPW0_SIZE                      equ 0001h
PWM9DCL_PWMPW0_LENGTH                    equ 0001h
PWM9DCL_PWMPW0_MASK                      equ 0040h
PWM9DCL_PWMPW1_POSN                      equ 0007h
PWM9DCL_PWMPW1_POSITION                  equ 0007h
PWM9DCL_PWMPW1_SIZE                      equ 0001h
PWM9DCL_PWMPW1_LENGTH                    equ 0001h
PWM9DCL_PWMPW1_MASK                      equ 0080h

// Register: PWM9DCH
#define PWM9DCH PWM9DCH
PWM9DCH                                  equ 061Bh
// bitfield definitions
PWM9DCH_DC_POSN                          equ 0000h
PWM9DCH_DC_POSITION                      equ 0000h
PWM9DCH_DC_SIZE                          equ 0008h
PWM9DCH_DC_LENGTH                        equ 0008h
PWM9DCH_DC_MASK                          equ 00FFh
PWM9DCH_DC2_POSN                         equ 0000h
PWM9DCH_DC2_POSITION                     equ 0000h
PWM9DCH_DC2_SIZE                         equ 0001h
PWM9DCH_DC2_LENGTH                       equ 0001h
PWM9DCH_DC2_MASK                         equ 0001h
PWM9DCH_DC3_POSN                         equ 0001h
PWM9DCH_DC3_POSITION                     equ 0001h
PWM9DCH_DC3_SIZE                         equ 0001h
PWM9DCH_DC3_LENGTH                       equ 0001h
PWM9DCH_DC3_MASK                         equ 0002h
PWM9DCH_DC4_POSN                         equ 0002h
PWM9DCH_DC4_POSITION                     equ 0002h
PWM9DCH_DC4_SIZE                         equ 0001h
PWM9DCH_DC4_LENGTH                       equ 0001h
PWM9DCH_DC4_MASK                         equ 0004h
PWM9DCH_DC5_POSN                         equ 0003h
PWM9DCH_DC5_POSITION                     equ 0003h
PWM9DCH_DC5_SIZE                         equ 0001h
PWM9DCH_DC5_LENGTH                       equ 0001h
PWM9DCH_DC5_MASK                         equ 0008h
PWM9DCH_DC6_POSN                         equ 0004h
PWM9DCH_DC6_POSITION                     equ 0004h
PWM9DCH_DC6_SIZE                         equ 0001h
PWM9DCH_DC6_LENGTH                       equ 0001h
PWM9DCH_DC6_MASK                         equ 0010h
PWM9DCH_DC7_POSN                         equ 0005h
PWM9DCH_DC7_POSITION                     equ 0005h
PWM9DCH_DC7_SIZE                         equ 0001h
PWM9DCH_DC7_LENGTH                       equ 0001h
PWM9DCH_DC7_MASK                         equ 0020h
PWM9DCH_DC8_POSN                         equ 0006h
PWM9DCH_DC8_POSITION                     equ 0006h
PWM9DCH_DC8_SIZE                         equ 0001h
PWM9DCH_DC8_LENGTH                       equ 0001h
PWM9DCH_DC8_MASK                         equ 0040h
PWM9DCH_DC9_POSN                         equ 0007h
PWM9DCH_DC9_POSITION                     equ 0007h
PWM9DCH_DC9_SIZE                         equ 0001h
PWM9DCH_DC9_LENGTH                       equ 0001h
PWM9DCH_DC9_MASK                         equ 0080h
PWM9DCH_PWM9DC2_POSN                     equ 0000h
PWM9DCH_PWM9DC2_POSITION                 equ 0000h
PWM9DCH_PWM9DC2_SIZE                     equ 0001h
PWM9DCH_PWM9DC2_LENGTH                   equ 0001h
PWM9DCH_PWM9DC2_MASK                     equ 0001h
PWM9DCH_PWM9DC3_POSN                     equ 0001h
PWM9DCH_PWM9DC3_POSITION                 equ 0001h
PWM9DCH_PWM9DC3_SIZE                     equ 0001h
PWM9DCH_PWM9DC3_LENGTH                   equ 0001h
PWM9DCH_PWM9DC3_MASK                     equ 0002h
PWM9DCH_PWM9DC4_POSN                     equ 0002h
PWM9DCH_PWM9DC4_POSITION                 equ 0002h
PWM9DCH_PWM9DC4_SIZE                     equ 0001h
PWM9DCH_PWM9DC4_LENGTH                   equ 0001h
PWM9DCH_PWM9DC4_MASK                     equ 0004h
PWM9DCH_PWM9DC5_POSN                     equ 0003h
PWM9DCH_PWM9DC5_POSITION                 equ 0003h
PWM9DCH_PWM9DC5_SIZE                     equ 0001h
PWM9DCH_PWM9DC5_LENGTH                   equ 0001h
PWM9DCH_PWM9DC5_MASK                     equ 0008h
PWM9DCH_PWM9DC6_POSN                     equ 0004h
PWM9DCH_PWM9DC6_POSITION                 equ 0004h
PWM9DCH_PWM9DC6_SIZE                     equ 0001h
PWM9DCH_PWM9DC6_LENGTH                   equ 0001h
PWM9DCH_PWM9DC6_MASK                     equ 0010h
PWM9DCH_PWM9DC7_POSN                     equ 0005h
PWM9DCH_PWM9DC7_POSITION                 equ 0005h
PWM9DCH_PWM9DC7_SIZE                     equ 0001h
PWM9DCH_PWM9DC7_LENGTH                   equ 0001h
PWM9DCH_PWM9DC7_MASK                     equ 0020h
PWM9DCH_PWM9DC8_POSN                     equ 0006h
PWM9DCH_PWM9DC8_POSITION                 equ 0006h
PWM9DCH_PWM9DC8_SIZE                     equ 0001h
PWM9DCH_PWM9DC8_LENGTH                   equ 0001h
PWM9DCH_PWM9DC8_MASK                     equ 0040h
PWM9DCH_PWM9DC9_POSN                     equ 0007h
PWM9DCH_PWM9DC9_POSITION                 equ 0007h
PWM9DCH_PWM9DC9_SIZE                     equ 0001h
PWM9DCH_PWM9DC9_LENGTH                   equ 0001h
PWM9DCH_PWM9DC9_MASK                     equ 0080h
PWM9DCH_PWMPW2_POSN                      equ 0000h
PWM9DCH_PWMPW2_POSITION                  equ 0000h
PWM9DCH_PWMPW2_SIZE                      equ 0001h
PWM9DCH_PWMPW2_LENGTH                    equ 0001h
PWM9DCH_PWMPW2_MASK                      equ 0001h
PWM9DCH_PWMPW3_POSN                      equ 0001h
PWM9DCH_PWMPW3_POSITION                  equ 0001h
PWM9DCH_PWMPW3_SIZE                      equ 0001h
PWM9DCH_PWMPW3_LENGTH                    equ 0001h
PWM9DCH_PWMPW3_MASK                      equ 0002h
PWM9DCH_PWMPW4_POSN                      equ 0002h
PWM9DCH_PWMPW4_POSITION                  equ 0002h
PWM9DCH_PWMPW4_SIZE                      equ 0001h
PWM9DCH_PWMPW4_LENGTH                    equ 0001h
PWM9DCH_PWMPW4_MASK                      equ 0004h
PWM9DCH_PWMPW5_POSN                      equ 0003h
PWM9DCH_PWMPW5_POSITION                  equ 0003h
PWM9DCH_PWMPW5_SIZE                      equ 0001h
PWM9DCH_PWMPW5_LENGTH                    equ 0001h
PWM9DCH_PWMPW5_MASK                      equ 0008h
PWM9DCH_PWMPW6_POSN                      equ 0004h
PWM9DCH_PWMPW6_POSITION                  equ 0004h
PWM9DCH_PWMPW6_SIZE                      equ 0001h
PWM9DCH_PWMPW6_LENGTH                    equ 0001h
PWM9DCH_PWMPW6_MASK                      equ 0010h
PWM9DCH_PWMPW7_POSN                      equ 0005h
PWM9DCH_PWMPW7_POSITION                  equ 0005h
PWM9DCH_PWMPW7_SIZE                      equ 0001h
PWM9DCH_PWMPW7_LENGTH                    equ 0001h
PWM9DCH_PWMPW7_MASK                      equ 0020h
PWM9DCH_PWMPW8_POSN                      equ 0006h
PWM9DCH_PWMPW8_POSITION                  equ 0006h
PWM9DCH_PWMPW8_SIZE                      equ 0001h
PWM9DCH_PWMPW8_LENGTH                    equ 0001h
PWM9DCH_PWMPW8_MASK                      equ 0040h
PWM9DCH_PWMPW9_POSN                      equ 0007h
PWM9DCH_PWMPW9_POSITION                  equ 0007h
PWM9DCH_PWMPW9_SIZE                      equ 0001h
PWM9DCH_PWMPW9_LENGTH                    equ 0001h
PWM9DCH_PWMPW9_MASK                      equ 0080h

// Register: PWM9CON
#define PWM9CON PWM9CON
PWM9CON                                  equ 061Ch
// bitfield definitions
PWM9CON_POL_POSN                         equ 0004h
PWM9CON_POL_POSITION                     equ 0004h
PWM9CON_POL_SIZE                         equ 0001h
PWM9CON_POL_LENGTH                       equ 0001h
PWM9CON_POL_MASK                         equ 0010h
PWM9CON_OUT_POSN                         equ 0005h
PWM9CON_OUT_POSITION                     equ 0005h
PWM9CON_OUT_SIZE                         equ 0001h
PWM9CON_OUT_LENGTH                       equ 0001h
PWM9CON_OUT_MASK                         equ 0020h
PWM9CON_OE_POSN                          equ 0006h
PWM9CON_OE_POSITION                      equ 0006h
PWM9CON_OE_SIZE                          equ 0001h
PWM9CON_OE_LENGTH                        equ 0001h
PWM9CON_OE_MASK                          equ 0040h
PWM9CON_EN_POSN                          equ 0007h
PWM9CON_EN_POSITION                      equ 0007h
PWM9CON_EN_SIZE                          equ 0001h
PWM9CON_EN_LENGTH                        equ 0001h
PWM9CON_EN_MASK                          equ 0080h
PWM9CON_PWM9POL_POSN                     equ 0004h
PWM9CON_PWM9POL_POSITION                 equ 0004h
PWM9CON_PWM9POL_SIZE                     equ 0001h
PWM9CON_PWM9POL_LENGTH                   equ 0001h
PWM9CON_PWM9POL_MASK                     equ 0010h
PWM9CON_PWM9OUT_POSN                     equ 0005h
PWM9CON_PWM9OUT_POSITION                 equ 0005h
PWM9CON_PWM9OUT_SIZE                     equ 0001h
PWM9CON_PWM9OUT_LENGTH                   equ 0001h
PWM9CON_PWM9OUT_MASK                     equ 0020h
PWM9CON_PWM9OE_POSN                      equ 0006h
PWM9CON_PWM9OE_POSITION                  equ 0006h
PWM9CON_PWM9OE_SIZE                      equ 0001h
PWM9CON_PWM9OE_LENGTH                    equ 0001h
PWM9CON_PWM9OE_MASK                      equ 0040h
PWM9CON_PWM9EN_POSN                      equ 0007h
PWM9CON_PWM9EN_POSITION                  equ 0007h
PWM9CON_PWM9EN_SIZE                      equ 0001h
PWM9CON_PWM9EN_LENGTH                    equ 0001h
PWM9CON_PWM9EN_MASK                      equ 0080h

// Register: COG1PHR
#define COG1PHR COG1PHR
COG1PHR                                  equ 068Dh
// bitfield definitions
COG1PHR_PHR_POSN                         equ 0000h
COG1PHR_PHR_POSITION                     equ 0000h
COG1PHR_PHR_SIZE                         equ 0006h
COG1PHR_PHR_LENGTH                       equ 0006h
COG1PHR_PHR_MASK                         equ 003Fh
COG1PHR_PHR0_POSN                        equ 0000h
COG1PHR_PHR0_POSITION                    equ 0000h
COG1PHR_PHR0_SIZE                        equ 0001h
COG1PHR_PHR0_LENGTH                      equ 0001h
COG1PHR_PHR0_MASK                        equ 0001h
COG1PHR_PHR1_POSN                        equ 0001h
COG1PHR_PHR1_POSITION                    equ 0001h
COG1PHR_PHR1_SIZE                        equ 0001h
COG1PHR_PHR1_LENGTH                      equ 0001h
COG1PHR_PHR1_MASK                        equ 0002h
COG1PHR_PHR2_POSN                        equ 0002h
COG1PHR_PHR2_POSITION                    equ 0002h
COG1PHR_PHR2_SIZE                        equ 0001h
COG1PHR_PHR2_LENGTH                      equ 0001h
COG1PHR_PHR2_MASK                        equ 0004h
COG1PHR_PHR3_POSN                        equ 0003h
COG1PHR_PHR3_POSITION                    equ 0003h
COG1PHR_PHR3_SIZE                        equ 0001h
COG1PHR_PHR3_LENGTH                      equ 0001h
COG1PHR_PHR3_MASK                        equ 0008h
COG1PHR_PHR4_POSN                        equ 0004h
COG1PHR_PHR4_POSITION                    equ 0004h
COG1PHR_PHR4_SIZE                        equ 0001h
COG1PHR_PHR4_LENGTH                      equ 0001h
COG1PHR_PHR4_MASK                        equ 0010h
COG1PHR_PHR5_POSN                        equ 0005h
COG1PHR_PHR5_POSITION                    equ 0005h
COG1PHR_PHR5_SIZE                        equ 0001h
COG1PHR_PHR5_LENGTH                      equ 0001h
COG1PHR_PHR5_MASK                        equ 0020h
COG1PHR_G1PHR0_POSN                      equ 0000h
COG1PHR_G1PHR0_POSITION                  equ 0000h
COG1PHR_G1PHR0_SIZE                      equ 0001h
COG1PHR_G1PHR0_LENGTH                    equ 0001h
COG1PHR_G1PHR0_MASK                      equ 0001h
COG1PHR_G1PHR1_POSN                      equ 0001h
COG1PHR_G1PHR1_POSITION                  equ 0001h
COG1PHR_G1PHR1_SIZE                      equ 0001h
COG1PHR_G1PHR1_LENGTH                    equ 0001h
COG1PHR_G1PHR1_MASK                      equ 0002h
COG1PHR_G1PHR2_POSN                      equ 0002h
COG1PHR_G1PHR2_POSITION                  equ 0002h
COG1PHR_G1PHR2_SIZE                      equ 0001h
COG1PHR_G1PHR2_LENGTH                    equ 0001h
COG1PHR_G1PHR2_MASK                      equ 0004h
COG1PHR_G1PHR3_POSN                      equ 0003h
COG1PHR_G1PHR3_POSITION                  equ 0003h
COG1PHR_G1PHR3_SIZE                      equ 0001h
COG1PHR_G1PHR3_LENGTH                    equ 0001h
COG1PHR_G1PHR3_MASK                      equ 0008h
COG1PHR_G1PHR4_POSN                      equ 0004h
COG1PHR_G1PHR4_POSITION                  equ 0004h
COG1PHR_G1PHR4_SIZE                      equ 0001h
COG1PHR_G1PHR4_LENGTH                    equ 0001h
COG1PHR_G1PHR4_MASK                      equ 0010h
COG1PHR_G1PHR5_POSN                      equ 0005h
COG1PHR_G1PHR5_POSITION                  equ 0005h
COG1PHR_G1PHR5_SIZE                      equ 0001h
COG1PHR_G1PHR5_LENGTH                    equ 0001h
COG1PHR_G1PHR5_MASK                      equ 0020h

// Register: COG1PHF
#define COG1PHF COG1PHF
COG1PHF                                  equ 068Eh
// bitfield definitions
COG1PHF_PHF_POSN                         equ 0000h
COG1PHF_PHF_POSITION                     equ 0000h
COG1PHF_PHF_SIZE                         equ 0006h
COG1PHF_PHF_LENGTH                       equ 0006h
COG1PHF_PHF_MASK                         equ 003Fh
COG1PHF_PHF0_POSN                        equ 0000h
COG1PHF_PHF0_POSITION                    equ 0000h
COG1PHF_PHF0_SIZE                        equ 0001h
COG1PHF_PHF0_LENGTH                      equ 0001h
COG1PHF_PHF0_MASK                        equ 0001h
COG1PHF_PHF1_POSN                        equ 0001h
COG1PHF_PHF1_POSITION                    equ 0001h
COG1PHF_PHF1_SIZE                        equ 0001h
COG1PHF_PHF1_LENGTH                      equ 0001h
COG1PHF_PHF1_MASK                        equ 0002h
COG1PHF_PHF2_POSN                        equ 0002h
COG1PHF_PHF2_POSITION                    equ 0002h
COG1PHF_PHF2_SIZE                        equ 0001h
COG1PHF_PHF2_LENGTH                      equ 0001h
COG1PHF_PHF2_MASK                        equ 0004h
COG1PHF_PHF3_POSN                        equ 0003h
COG1PHF_PHF3_POSITION                    equ 0003h
COG1PHF_PHF3_SIZE                        equ 0001h
COG1PHF_PHF3_LENGTH                      equ 0001h
COG1PHF_PHF3_MASK                        equ 0008h
COG1PHF_PHF4_POSN                        equ 0004h
COG1PHF_PHF4_POSITION                    equ 0004h
COG1PHF_PHF4_SIZE                        equ 0001h
COG1PHF_PHF4_LENGTH                      equ 0001h
COG1PHF_PHF4_MASK                        equ 0010h
COG1PHF_PHF5_POSN                        equ 0005h
COG1PHF_PHF5_POSITION                    equ 0005h
COG1PHF_PHF5_SIZE                        equ 0001h
COG1PHF_PHF5_LENGTH                      equ 0001h
COG1PHF_PHF5_MASK                        equ 0020h
COG1PHF_G1PHF0_POSN                      equ 0000h
COG1PHF_G1PHF0_POSITION                  equ 0000h
COG1PHF_G1PHF0_SIZE                      equ 0001h
COG1PHF_G1PHF0_LENGTH                    equ 0001h
COG1PHF_G1PHF0_MASK                      equ 0001h
COG1PHF_G1PHF1_POSN                      equ 0001h
COG1PHF_G1PHF1_POSITION                  equ 0001h
COG1PHF_G1PHF1_SIZE                      equ 0001h
COG1PHF_G1PHF1_LENGTH                    equ 0001h
COG1PHF_G1PHF1_MASK                      equ 0002h
COG1PHF_G1PHF2_POSN                      equ 0002h
COG1PHF_G1PHF2_POSITION                  equ 0002h
COG1PHF_G1PHF2_SIZE                      equ 0001h
COG1PHF_G1PHF2_LENGTH                    equ 0001h
COG1PHF_G1PHF2_MASK                      equ 0004h
COG1PHF_G1PHF3_POSN                      equ 0003h
COG1PHF_G1PHF3_POSITION                  equ 0003h
COG1PHF_G1PHF3_SIZE                      equ 0001h
COG1PHF_G1PHF3_LENGTH                    equ 0001h
COG1PHF_G1PHF3_MASK                      equ 0008h
COG1PHF_G1PHF4_POSN                      equ 0004h
COG1PHF_G1PHF4_POSITION                  equ 0004h
COG1PHF_G1PHF4_SIZE                      equ 0001h
COG1PHF_G1PHF4_LENGTH                    equ 0001h
COG1PHF_G1PHF4_MASK                      equ 0010h
COG1PHF_G1PHF5_POSN                      equ 0005h
COG1PHF_G1PHF5_POSITION                  equ 0005h
COG1PHF_G1PHF5_SIZE                      equ 0001h
COG1PHF_G1PHF5_LENGTH                    equ 0001h
COG1PHF_G1PHF5_MASK                      equ 0020h

