GopalSaraf/Practicals/PSDL/include/proc/pic16lf1773.inc
// Register: COG3RSIM0
#define COG3RSIM0 COG3RSIM0
COG3RSIM0                                equ 0817h
// bitfield definitions
COG3RSIM0_RSIM0_POSN                     equ 0000h
COG3RSIM0_RSIM0_POSITION                 equ 0000h
COG3RSIM0_RSIM0_SIZE                     equ 0001h
COG3RSIM0_RSIM0_LENGTH                   equ 0001h
COG3RSIM0_RSIM0_MASK                     equ 0001h
COG3RSIM0_RSIM1_POSN                     equ 0001h
COG3RSIM0_RSIM1_POSITION                 equ 0001h
COG3RSIM0_RSIM1_SIZE                     equ 0001h
COG3RSIM0_RSIM1_LENGTH                   equ 0001h
COG3RSIM0_RSIM1_MASK                     equ 0002h
COG3RSIM0_RSIM2_POSN                     equ 0002h
COG3RSIM0_RSIM2_POSITION                 equ 0002h
COG3RSIM0_RSIM2_SIZE                     equ 0001h
COG3RSIM0_RSIM2_LENGTH                   equ 0001h
COG3RSIM0_RSIM2_MASK                     equ 0004h
COG3RSIM0_RSIM3_POSN                     equ 0003h
COG3RSIM0_RSIM3_POSITION                 equ 0003h
COG3RSIM0_RSIM3_SIZE                     equ 0001h
COG3RSIM0_RSIM3_LENGTH                   equ 0001h
COG3RSIM0_RSIM3_MASK                     equ 0008h
COG3RSIM0_RSIM4_POSN                     equ 0004h
COG3RSIM0_RSIM4_POSITION                 equ 0004h
COG3RSIM0_RSIM4_SIZE                     equ 0001h
COG3RSIM0_RSIM4_LENGTH                   equ 0001h
COG3RSIM0_RSIM4_MASK                     equ 0010h
COG3RSIM0_RSIM5_POSN                     equ 0005h
COG3RSIM0_RSIM5_POSITION                 equ 0005h
COG3RSIM0_RSIM5_SIZE                     equ 0001h
COG3RSIM0_RSIM5_LENGTH                   equ 0001h
COG3RSIM0_RSIM5_MASK                     equ 0020h
COG3RSIM0_RSIM6_POSN                     equ 0006h
COG3RSIM0_RSIM6_POSITION                 equ 0006h
COG3RSIM0_RSIM6_SIZE                     equ 0001h
COG3RSIM0_RSIM6_LENGTH                   equ 0001h
COG3RSIM0_RSIM6_MASK                     equ 0040h
COG3RSIM0_RSIM7_POSN                     equ 0007h
COG3RSIM0_RSIM7_POSITION                 equ 0007h
COG3RSIM0_RSIM7_SIZE                     equ 0001h
COG3RSIM0_RSIM7_LENGTH                   equ 0001h
COG3RSIM0_RSIM7_MASK                     equ 0080h
COG3RSIM0_G3RSIM0_POSN                   equ 0000h
COG3RSIM0_G3RSIM0_POSITION               equ 0000h
COG3RSIM0_G3RSIM0_SIZE                   equ 0001h
COG3RSIM0_G3RSIM0_LENGTH                 equ 0001h
COG3RSIM0_G3RSIM0_MASK                   equ 0001h
COG3RSIM0_G3RSIM1_POSN                   equ 0001h
COG3RSIM0_G3RSIM1_POSITION               equ 0001h
COG3RSIM0_G3RSIM1_SIZE                   equ 0001h
COG3RSIM0_G3RSIM1_LENGTH                 equ 0001h
COG3RSIM0_G3RSIM1_MASK                   equ 0002h
COG3RSIM0_G3RSIM2_POSN                   equ 0002h
COG3RSIM0_G3RSIM2_POSITION               equ 0002h
COG3RSIM0_G3RSIM2_SIZE                   equ 0001h
COG3RSIM0_G3RSIM2_LENGTH                 equ 0001h
COG3RSIM0_G3RSIM2_MASK                   equ 0004h
COG3RSIM0_G3RSIM3_POSN                   equ 0003h
COG3RSIM0_G3RSIM3_POSITION               equ 0003h
COG3RSIM0_G3RSIM3_SIZE                   equ 0001h
COG3RSIM0_G3RSIM3_LENGTH                 equ 0001h
COG3RSIM0_G3RSIM3_MASK                   equ 0008h
COG3RSIM0_G3RSIM4_POSN                   equ 0004h
COG3RSIM0_G3RSIM4_POSITION               equ 0004h
COG3RSIM0_G3RSIM4_SIZE                   equ 0001h
COG3RSIM0_G3RSIM4_LENGTH                 equ 0001h
COG3RSIM0_G3RSIM4_MASK                   equ 0010h
COG3RSIM0_G3RSIM5_POSN                   equ 0005h
COG3RSIM0_G3RSIM5_POSITION               equ 0005h
COG3RSIM0_G3RSIM5_SIZE                   equ 0001h
COG3RSIM0_G3RSIM5_LENGTH                 equ 0001h
COG3RSIM0_G3RSIM5_MASK                   equ 0020h
COG3RSIM0_G3RSIM6_POSN                   equ 0006h
COG3RSIM0_G3RSIM6_POSITION               equ 0006h
COG3RSIM0_G3RSIM6_SIZE                   equ 0001h
COG3RSIM0_G3RSIM6_LENGTH                 equ 0001h
COG3RSIM0_G3RSIM6_MASK                   equ 0040h
COG3RSIM0_G3RSIM7_POSN                   equ 0007h
COG3RSIM0_G3RSIM7_POSITION               equ 0007h
COG3RSIM0_G3RSIM7_SIZE                   equ 0001h
COG3RSIM0_G3RSIM7_LENGTH                 equ 0001h
COG3RSIM0_G3RSIM7_MASK                   equ 0080h

// Register: COG3RSIM1
#define COG3RSIM1 COG3RSIM1
COG3RSIM1                                equ 0818h
// bitfield definitions
COG3RSIM1_RSIM9_POSN                     equ 0001h
COG3RSIM1_RSIM9_POSITION                 equ 0001h
COG3RSIM1_RSIM9_SIZE                     equ 0001h
COG3RSIM1_RSIM9_LENGTH                   equ 0001h
COG3RSIM1_RSIM9_MASK                     equ 0002h
COG3RSIM1_RSIM11_POSN                    equ 0003h
COG3RSIM1_RSIM11_POSITION                equ 0003h
COG3RSIM1_RSIM11_SIZE                    equ 0001h
COG3RSIM1_RSIM11_LENGTH                  equ 0001h
COG3RSIM1_RSIM11_MASK                    equ 0008h
COG3RSIM1_RSIM12_POSN                    equ 0004h
COG3RSIM1_RSIM12_POSITION                equ 0004h
COG3RSIM1_RSIM12_SIZE                    equ 0001h
COG3RSIM1_RSIM12_LENGTH                  equ 0001h
COG3RSIM1_RSIM12_MASK                    equ 0010h
COG3RSIM1_RSIM13_POSN                    equ 0005h
COG3RSIM1_RSIM13_POSITION                equ 0005h
COG3RSIM1_RSIM13_SIZE                    equ 0001h
COG3RSIM1_RSIM13_LENGTH                  equ 0001h
COG3RSIM1_RSIM13_MASK                    equ 0020h
COG3RSIM1_RSIM14_POSN                    equ 0006h
COG3RSIM1_RSIM14_POSITION                equ 0006h
COG3RSIM1_RSIM14_SIZE                    equ 0001h
COG3RSIM1_RSIM14_LENGTH                  equ 0001h
COG3RSIM1_RSIM14_MASK                    equ 0040h
COG3RSIM1_RSIM15_POSN                    equ 0007h
COG3RSIM1_RSIM15_POSITION                equ 0007h
COG3RSIM1_RSIM15_SIZE                    equ 0001h
COG3RSIM1_RSIM15_LENGTH                  equ 0001h
COG3RSIM1_RSIM15_MASK                    equ 0080h
COG3RSIM1_G3RSIM9_POSN                   equ 0001h
COG3RSIM1_G3RSIM9_POSITION               equ 0001h
COG3RSIM1_G3RSIM9_SIZE                   equ 0001h
COG3RSIM1_G3RSIM9_LENGTH                 equ 0001h
COG3RSIM1_G3RSIM9_MASK                   equ 0002h
COG3RSIM1_G3RSIM11_POSN                  equ 0003h
COG3RSIM1_G3RSIM11_POSITION              equ 0003h
COG3RSIM1_G3RSIM11_SIZE                  equ 0001h
COG3RSIM1_G3RSIM11_LENGTH                equ 0001h
COG3RSIM1_G3RSIM11_MASK                  equ 0008h
COG3RSIM1_G3RSIM12_POSN                  equ 0004h
COG3RSIM1_G3RSIM12_POSITION              equ 0004h
COG3RSIM1_G3RSIM12_SIZE                  equ 0001h
COG3RSIM1_G3RSIM12_LENGTH                equ 0001h
COG3RSIM1_G3RSIM12_MASK                  equ 0010h
COG3RSIM1_G3RSIM13_POSN                  equ 0005h
COG3RSIM1_G3RSIM13_POSITION              equ 0005h
COG3RSIM1_G3RSIM13_SIZE                  equ 0001h
COG3RSIM1_G3RSIM13_LENGTH                equ 0001h
COG3RSIM1_G3RSIM13_MASK                  equ 0020h
COG3RSIM1_G3RSIM14_POSN                  equ 0006h
COG3RSIM1_G3RSIM14_POSITION              equ 0006h
COG3RSIM1_G3RSIM14_SIZE                  equ 0001h
COG3RSIM1_G3RSIM14_LENGTH                equ 0001h
COG3RSIM1_G3RSIM14_MASK                  equ 0040h
COG3RSIM1_G3RSIM15_POSN                  equ 0007h
COG3RSIM1_G3RSIM15_POSITION              equ 0007h
COG3RSIM1_G3RSIM15_SIZE                  equ 0001h
COG3RSIM1_G3RSIM15_LENGTH                equ 0001h
COG3RSIM1_G3RSIM15_MASK                  equ 0080h

// Register: COG3FIS0
#define COG3FIS0 COG3FIS0
COG3FIS0                                 equ 0819h
// bitfield definitions
COG3FIS0_FIS0_POSN                       equ 0000h
COG3FIS0_FIS0_POSITION                   equ 0000h
COG3FIS0_FIS0_SIZE                       equ 0001h
COG3FIS0_FIS0_LENGTH                     equ 0001h
COG3FIS0_FIS0_MASK                       equ 0001h
COG3FIS0_FIS1_POSN                       equ 0001h
COG3FIS0_FIS1_POSITION                   equ 0001h
COG3FIS0_FIS1_SIZE                       equ 0001h
COG3FIS0_FIS1_LENGTH                     equ 0001h
COG3FIS0_FIS1_MASK                       equ 0002h
COG3FIS0_FIS2_POSN                       equ 0002h
COG3FIS0_FIS2_POSITION                   equ 0002h
COG3FIS0_FIS2_SIZE                       equ 0001h
COG3FIS0_FIS2_LENGTH                     equ 0001h
COG3FIS0_FIS2_MASK                       equ 0004h
COG3FIS0_FIS3_POSN                       equ 0003h
COG3FIS0_FIS3_POSITION                   equ 0003h
COG3FIS0_FIS3_SIZE                       equ 0001h
COG3FIS0_FIS3_LENGTH                     equ 0001h
COG3FIS0_FIS3_MASK                       equ 0008h
COG3FIS0_FIS4_POSN                       equ 0004h
COG3FIS0_FIS4_POSITION                   equ 0004h
COG3FIS0_FIS4_SIZE                       equ 0001h
COG3FIS0_FIS4_LENGTH                     equ 0001h
COG3FIS0_FIS4_MASK                       equ 0010h
COG3FIS0_FIS5_POSN                       equ 0005h
COG3FIS0_FIS5_POSITION                   equ 0005h
COG3FIS0_FIS5_SIZE                       equ 0001h
COG3FIS0_FIS5_LENGTH                     equ 0001h
COG3FIS0_FIS5_MASK                       equ 0020h
COG3FIS0_FIS6_POSN                       equ 0006h
COG3FIS0_FIS6_POSITION                   equ 0006h
COG3FIS0_FIS6_SIZE                       equ 0001h
COG3FIS0_FIS6_LENGTH                     equ 0001h
COG3FIS0_FIS6_MASK                       equ 0040h
COG3FIS0_FIS7_POSN                       equ 0007h
COG3FIS0_FIS7_POSITION                   equ 0007h
COG3FIS0_FIS7_SIZE                       equ 0001h
COG3FIS0_FIS7_LENGTH                     equ 0001h
COG3FIS0_FIS7_MASK                       equ 0080h
COG3FIS0_G3FIS0_POSN                     equ 0000h
COG3FIS0_G3FIS0_POSITION                 equ 0000h
COG3FIS0_G3FIS0_SIZE                     equ 0001h
COG3FIS0_G3FIS0_LENGTH                   equ 0001h
COG3FIS0_G3FIS0_MASK                     equ 0001h
COG3FIS0_G3FIS1_POSN                     equ 0001h
COG3FIS0_G3FIS1_POSITION                 equ 0001h
COG3FIS0_G3FIS1_SIZE                     equ 0001h
COG3FIS0_G3FIS1_LENGTH                   equ 0001h
COG3FIS0_G3FIS1_MASK                     equ 0002h
COG3FIS0_G3FIS2_POSN                     equ 0002h
COG3FIS0_G3FIS2_POSITION                 equ 0002h
COG3FIS0_G3FIS2_SIZE                     equ 0001h
COG3FIS0_G3FIS2_LENGTH                   equ 0001h
COG3FIS0_G3FIS2_MASK                     equ 0004h
COG3FIS0_G3FIS3_POSN                     equ 0003h
COG3FIS0_G3FIS3_POSITION                 equ 0003h
COG3FIS0_G3FIS3_SIZE                     equ 0001h
COG3FIS0_G3FIS3_LENGTH                   equ 0001h
COG3FIS0_G3FIS3_MASK                     equ 0008h
COG3FIS0_G3FIS4_POSN                     equ 0004h
COG3FIS0_G3FIS4_POSITION                 equ 0004h
COG3FIS0_G3FIS4_SIZE                     equ 0001h
COG3FIS0_G3FIS4_LENGTH                   equ 0001h
COG3FIS0_G3FIS4_MASK                     equ 0010h
COG3FIS0_G3FIS5_POSN                     equ 0005h
COG3FIS0_G3FIS5_POSITION                 equ 0005h
COG3FIS0_G3FIS5_SIZE                     equ 0001h
COG3FIS0_G3FIS5_LENGTH                   equ 0001h
COG3FIS0_G3FIS5_MASK                     equ 0020h
COG3FIS0_G3FIS6_POSN                     equ 0006h
COG3FIS0_G3FIS6_POSITION                 equ 0006h
COG3FIS0_G3FIS6_SIZE                     equ 0001h
COG3FIS0_G3FIS6_LENGTH                   equ 0001h
COG3FIS0_G3FIS6_MASK                     equ 0040h
COG3FIS0_G3FIS7_POSN                     equ 0007h
COG3FIS0_G3FIS7_POSITION                 equ 0007h
COG3FIS0_G3FIS7_SIZE                     equ 0001h
COG3FIS0_G3FIS7_LENGTH                   equ 0001h
COG3FIS0_G3FIS7_MASK                     equ 0080h

// Register: COG3FIS1
#define COG3FIS1 COG3FIS1
COG3FIS1                                 equ 081Ah
// bitfield definitions
COG3FIS1_FIS9_POSN                       equ 0001h
COG3FIS1_FIS9_POSITION                   equ 0001h
COG3FIS1_FIS9_SIZE                       equ 0001h
COG3FIS1_FIS9_LENGTH                     equ 0001h
COG3FIS1_FIS9_MASK                       equ 0002h
COG3FIS1_FIS11_POSN                      equ 0003h
COG3FIS1_FIS11_POSITION                  equ 0003h
COG3FIS1_FIS11_SIZE                      equ 0001h
COG3FIS1_FIS11_LENGTH                    equ 0001h
COG3FIS1_FIS11_MASK                      equ 0008h
COG3FIS1_FIS12_POSN                      equ 0004h
COG3FIS1_FIS12_POSITION                  equ 0004h
COG3FIS1_FIS12_SIZE                      equ 0001h
COG3FIS1_FIS12_LENGTH                    equ 0001h
COG3FIS1_FIS12_MASK                      equ 0010h
COG3FIS1_FIS13_POSN                      equ 0005h
COG3FIS1_FIS13_POSITION                  equ 0005h
COG3FIS1_FIS13_SIZE                      equ 0001h
COG3FIS1_FIS13_LENGTH                    equ 0001h
COG3FIS1_FIS13_MASK                      equ 0020h
COG3FIS1_FIS14_POSN                      equ 0006h
COG3FIS1_FIS14_POSITION                  equ 0006h
COG3FIS1_FIS14_SIZE                      equ 0001h
COG3FIS1_FIS14_LENGTH                    equ 0001h
COG3FIS1_FIS14_MASK                      equ 0040h
COG3FIS1_FIS15_POSN                      equ 0007h
COG3FIS1_FIS15_POSITION                  equ 0007h
COG3FIS1_FIS15_SIZE                      equ 0001h
COG3FIS1_FIS15_LENGTH                    equ 0001h
COG3FIS1_FIS15_MASK                      equ 0080h
COG3FIS1_G3FIS9_POSN                     equ 0001h
COG3FIS1_G3FIS9_POSITION                 equ 0001h
COG3FIS1_G3FIS9_SIZE                     equ 0001h
COG3FIS1_G3FIS9_LENGTH                   equ 0001h
COG3FIS1_G3FIS9_MASK                     equ 0002h
COG3FIS1_G3FIS11_POSN                    equ 0003h
COG3FIS1_G3FIS11_POSITION                equ 0003h
COG3FIS1_G3FIS11_SIZE                    equ 0001h
COG3FIS1_G3FIS11_LENGTH                  equ 0001h
COG3FIS1_G3FIS11_MASK                    equ 0008h
COG3FIS1_G3FIS12_POSN                    equ 0004h
COG3FIS1_G3FIS12_POSITION                equ 0004h
COG3FIS1_G3FIS12_SIZE                    equ 0001h
COG3FIS1_G3FIS12_LENGTH                  equ 0001h
COG3FIS1_G3FIS12_MASK                    equ 0010h
COG3FIS1_G3FIS13_POSN                    equ 0005h
COG3FIS1_G3FIS13_POSITION                equ 0005h
COG3FIS1_G3FIS13_SIZE                    equ 0001h
COG3FIS1_G3FIS13_LENGTH                  equ 0001h
COG3FIS1_G3FIS13_MASK                    equ 0020h
COG3FIS1_G3FIS14_POSN                    equ 0006h
COG3FIS1_G3FIS14_POSITION                equ 0006h
COG3FIS1_G3FIS14_SIZE                    equ 0001h
COG3FIS1_G3FIS14_LENGTH                  equ 0001h
COG3FIS1_G3FIS14_MASK                    equ 0040h
COG3FIS1_G3FIS15_POSN                    equ 0007h
COG3FIS1_G3FIS15_POSITION                equ 0007h
COG3FIS1_G3FIS15_SIZE                    equ 0001h
COG3FIS1_G3FIS15_LENGTH                  equ 0001h
COG3FIS1_G3FIS15_MASK                    equ 0080h

// Register: COG3FSIM0
#define COG3FSIM0 COG3FSIM0
COG3FSIM0                                equ 081Bh
// bitfield definitions
COG3FSIM0_FSIM0_POSN                     equ 0000h
COG3FSIM0_FSIM0_POSITION                 equ 0000h
COG3FSIM0_FSIM0_SIZE                     equ 0001h
COG3FSIM0_FSIM0_LENGTH                   equ 0001h
COG3FSIM0_FSIM0_MASK                     equ 0001h
COG3FSIM0_FSIM1_POSN                     equ 0001h
COG3FSIM0_FSIM1_POSITION                 equ 0001h
COG3FSIM0_FSIM1_SIZE                     equ 0001h
COG3FSIM0_FSIM1_LENGTH                   equ 0001h
COG3FSIM0_FSIM1_MASK                     equ 0002h
COG3FSIM0_FSIM2_POSN                     equ 0002h
COG3FSIM0_FSIM2_POSITION                 equ 0002h
COG3FSIM0_FSIM2_SIZE                     equ 0001h
COG3FSIM0_FSIM2_LENGTH                   equ 0001h
COG3FSIM0_FSIM2_MASK                     equ 0004h
COG3FSIM0_FSIM3_POSN                     equ 0003h
COG3FSIM0_FSIM3_POSITION                 equ 0003h
COG3FSIM0_FSIM3_SIZE                     equ 0001h
COG3FSIM0_FSIM3_LENGTH                   equ 0001h
COG3FSIM0_FSIM3_MASK                     equ 0008h
COG3FSIM0_FSIM4_POSN                     equ 0004h
COG3FSIM0_FSIM4_POSITION                 equ 0004h
COG3FSIM0_FSIM4_SIZE                     equ 0001h
COG3FSIM0_FSIM4_LENGTH                   equ 0001h
COG3FSIM0_FSIM4_MASK                     equ 0010h
COG3FSIM0_FSIM5_POSN                     equ 0005h
COG3FSIM0_FSIM5_POSITION                 equ 0005h
COG3FSIM0_FSIM5_SIZE                     equ 0001h
COG3FSIM0_FSIM5_LENGTH                   equ 0001h
COG3FSIM0_FSIM5_MASK                     equ 0020h
COG3FSIM0_FSIM6_POSN                     equ 0006h
COG3FSIM0_FSIM6_POSITION                 equ 0006h
COG3FSIM0_FSIM6_SIZE                     equ 0001h
COG3FSIM0_FSIM6_LENGTH                   equ 0001h
COG3FSIM0_FSIM6_MASK                     equ 0040h
COG3FSIM0_FSIM7_POSN                     equ 0007h
COG3FSIM0_FSIM7_POSITION                 equ 0007h
COG3FSIM0_FSIM7_SIZE                     equ 0001h
COG3FSIM0_FSIM7_LENGTH                   equ 0001h
COG3FSIM0_FSIM7_MASK                     equ 0080h
COG3FSIM0_G3FSIM0_POSN                   equ 0000h
COG3FSIM0_G3FSIM0_POSITION               equ 0000h
COG3FSIM0_G3FSIM0_SIZE                   equ 0001h
COG3FSIM0_G3FSIM0_LENGTH                 equ 0001h
COG3FSIM0_G3FSIM0_MASK                   equ 0001h
COG3FSIM0_G3FSIM1_POSN                   equ 0001h
COG3FSIM0_G3FSIM1_POSITION               equ 0001h
COG3FSIM0_G3FSIM1_SIZE                   equ 0001h
COG3FSIM0_G3FSIM1_LENGTH                 equ 0001h
COG3FSIM0_G3FSIM1_MASK                   equ 0002h
COG3FSIM0_G3FSIM2_POSN                   equ 0002h
COG3FSIM0_G3FSIM2_POSITION               equ 0002h
COG3FSIM0_G3FSIM2_SIZE                   equ 0001h
COG3FSIM0_G3FSIM2_LENGTH                 equ 0001h
COG3FSIM0_G3FSIM2_MASK                   equ 0004h
COG3FSIM0_G3FSIM3_POSN                   equ 0003h
COG3FSIM0_G3FSIM3_POSITION               equ 0003h
COG3FSIM0_G3FSIM3_SIZE                   equ 0001h
COG3FSIM0_G3FSIM3_LENGTH                 equ 0001h
COG3FSIM0_G3FSIM3_MASK                   equ 0008h
COG3FSIM0_G3FSIM4_POSN                   equ 0004h
COG3FSIM0_G3FSIM4_POSITION               equ 0004h
COG3FSIM0_G3FSIM4_SIZE                   equ 0001h
COG3FSIM0_G3FSIM4_LENGTH                 equ 0001h
COG3FSIM0_G3FSIM4_MASK                   equ 0010h
COG3FSIM0_G3FSIM5_POSN                   equ 0005h
COG3FSIM0_G3FSIM5_POSITION               equ 0005h
COG3FSIM0_G3FSIM5_SIZE                   equ 0001h
COG3FSIM0_G3FSIM5_LENGTH                 equ 0001h
COG3FSIM0_G3FSIM5_MASK                   equ 0020h
COG3FSIM0_G3FSIM6_POSN                   equ 0006h
COG3FSIM0_G3FSIM6_POSITION               equ 0006h
COG3FSIM0_G3FSIM6_SIZE                   equ 0001h
COG3FSIM0_G3FSIM6_LENGTH                 equ 0001h
COG3FSIM0_G3FSIM6_MASK                   equ 0040h
COG3FSIM0_G3FSIM7_POSN                   equ 0007h
COG3FSIM0_G3FSIM7_POSITION               equ 0007h
COG3FSIM0_G3FSIM7_SIZE                   equ 0001h
COG3FSIM0_G3FSIM7_LENGTH                 equ 0001h
COG3FSIM0_G3FSIM7_MASK                   equ 0080h

