GopalSaraf/Practicals/PSDL/include/proc/pic16lf1773.inc
// Register: COG3STR
#define COG3STR COG3STR
COG3STR                                  equ 081Fh
// bitfield definitions
COG3STR_STRA_POSN                        equ 0000h
COG3STR_STRA_POSITION                    equ 0000h
COG3STR_STRA_SIZE                        equ 0001h
COG3STR_STRA_LENGTH                      equ 0001h
COG3STR_STRA_MASK                        equ 0001h
COG3STR_STRB_POSN                        equ 0001h
COG3STR_STRB_POSITION                    equ 0001h
COG3STR_STRB_SIZE                        equ 0001h
COG3STR_STRB_LENGTH                      equ 0001h
COG3STR_STRB_MASK                        equ 0002h
COG3STR_STRC_POSN                        equ 0002h
COG3STR_STRC_POSITION                    equ 0002h
COG3STR_STRC_SIZE                        equ 0001h
COG3STR_STRC_LENGTH                      equ 0001h
COG3STR_STRC_MASK                        equ 0004h
COG3STR_STRD_POSN                        equ 0003h
COG3STR_STRD_POSITION                    equ 0003h
COG3STR_STRD_SIZE                        equ 0001h
COG3STR_STRD_LENGTH                      equ 0001h
COG3STR_STRD_MASK                        equ 0008h
COG3STR_SDATA_POSN                       equ 0004h
COG3STR_SDATA_POSITION                   equ 0004h
COG3STR_SDATA_SIZE                       equ 0001h
COG3STR_SDATA_LENGTH                     equ 0001h
COG3STR_SDATA_MASK                       equ 0010h
COG3STR_SDATB_POSN                       equ 0005h
COG3STR_SDATB_POSITION                   equ 0005h
COG3STR_SDATB_SIZE                       equ 0001h
COG3STR_SDATB_LENGTH                     equ 0001h
COG3STR_SDATB_MASK                       equ 0020h
COG3STR_SDATC_POSN                       equ 0006h
COG3STR_SDATC_POSITION                   equ 0006h
COG3STR_SDATC_SIZE                       equ 0001h
COG3STR_SDATC_LENGTH                     equ 0001h
COG3STR_SDATC_MASK                       equ 0040h
COG3STR_SDATD_POSN                       equ 0007h
COG3STR_SDATD_POSITION                   equ 0007h
COG3STR_SDATD_SIZE                       equ 0001h
COG3STR_SDATD_LENGTH                     equ 0001h
COG3STR_SDATD_MASK                       equ 0080h
COG3STR_G3STRA_POSN                      equ 0000h
COG3STR_G3STRA_POSITION                  equ 0000h
COG3STR_G3STRA_SIZE                      equ 0001h
COG3STR_G3STRA_LENGTH                    equ 0001h
COG3STR_G3STRA_MASK                      equ 0001h
COG3STR_G3STRB_POSN                      equ 0001h
COG3STR_G3STRB_POSITION                  equ 0001h
COG3STR_G3STRB_SIZE                      equ 0001h
COG3STR_G3STRB_LENGTH                    equ 0001h
COG3STR_G3STRB_MASK                      equ 0002h
COG3STR_G3STRC_POSN                      equ 0002h
COG3STR_G3STRC_POSITION                  equ 0002h
COG3STR_G3STRC_SIZE                      equ 0001h
COG3STR_G3STRC_LENGTH                    equ 0001h
COG3STR_G3STRC_MASK                      equ 0004h
COG3STR_G3STRD_POSN                      equ 0003h
COG3STR_G3STRD_POSITION                  equ 0003h
COG3STR_G3STRD_SIZE                      equ 0001h
COG3STR_G3STRD_LENGTH                    equ 0001h
COG3STR_G3STRD_MASK                      equ 0008h
COG3STR_G3SDATA_POSN                     equ 0004h
COG3STR_G3SDATA_POSITION                 equ 0004h
COG3STR_G3SDATA_SIZE                     equ 0001h
COG3STR_G3SDATA_LENGTH                   equ 0001h
COG3STR_G3SDATA_MASK                     equ 0010h
COG3STR_G3SDATB_POSN                     equ 0005h
COG3STR_G3SDATB_POSITION                 equ 0005h
COG3STR_G3SDATB_SIZE                     equ 0001h
COG3STR_G3SDATB_LENGTH                   equ 0001h
COG3STR_G3SDATB_MASK                     equ 0020h
COG3STR_G3SDATC_POSN                     equ 0006h
COG3STR_G3SDATC_POSITION                 equ 0006h
COG3STR_G3SDATC_SIZE                     equ 0001h
COG3STR_G3SDATC_LENGTH                   equ 0001h
COG3STR_G3SDATC_MASK                     equ 0040h
COG3STR_G3SDATD_POSN                     equ 0007h
COG3STR_G3SDATD_POSITION                 equ 0007h
COG3STR_G3SDATD_SIZE                     equ 0001h
COG3STR_G3SDATD_LENGTH                   equ 0001h
COG3STR_G3SDATD_MASK                     equ 0080h

// Register: CM4CON0
#define CM4CON0 CM4CON0
CM4CON0                                  equ 090Ch
// bitfield definitions
CM4CON0_SYNC_POSN                        equ 0000h
CM4CON0_SYNC_POSITION                    equ 0000h
CM4CON0_SYNC_SIZE                        equ 0001h
CM4CON0_SYNC_LENGTH                      equ 0001h
CM4CON0_SYNC_MASK                        equ 0001h
CM4CON0_HYS_POSN                         equ 0001h
CM4CON0_HYS_POSITION                     equ 0001h
CM4CON0_HYS_SIZE                         equ 0001h
CM4CON0_HYS_LENGTH                       equ 0001h
CM4CON0_HYS_MASK                         equ 0002h
CM4CON0_ZLF_POSN                         equ 0003h
CM4CON0_ZLF_POSITION                     equ 0003h
CM4CON0_ZLF_SIZE                         equ 0001h
CM4CON0_ZLF_LENGTH                       equ 0001h
CM4CON0_ZLF_MASK                         equ 0008h
CM4CON0_POL_POSN                         equ 0004h
CM4CON0_POL_POSITION                     equ 0004h
CM4CON0_POL_SIZE                         equ 0001h
CM4CON0_POL_LENGTH                       equ 0001h
CM4CON0_POL_MASK                         equ 0010h
CM4CON0_OUT_POSN                         equ 0006h
CM4CON0_OUT_POSITION                     equ 0006h
CM4CON0_OUT_SIZE                         equ 0001h
CM4CON0_OUT_LENGTH                       equ 0001h
CM4CON0_OUT_MASK                         equ 0040h
CM4CON0_ON_POSN                          equ 0007h
CM4CON0_ON_POSITION                      equ 0007h
CM4CON0_ON_SIZE                          equ 0001h
CM4CON0_ON_LENGTH                        equ 0001h
CM4CON0_ON_MASK                          equ 0080h
CM4CON0_C4SYNC_POSN                      equ 0000h
CM4CON0_C4SYNC_POSITION                  equ 0000h
CM4CON0_C4SYNC_SIZE                      equ 0001h
CM4CON0_C4SYNC_LENGTH                    equ 0001h
CM4CON0_C4SYNC_MASK                      equ 0001h
CM4CON0_C4HYS_POSN                       equ 0001h
CM4CON0_C4HYS_POSITION                   equ 0001h
CM4CON0_C4HYS_SIZE                       equ 0001h
CM4CON0_C4HYS_LENGTH                     equ 0001h
CM4CON0_C4HYS_MASK                       equ 0002h
CM4CON0_C4SP_POSN                        equ 0002h
CM4CON0_C4SP_POSITION                    equ 0002h
CM4CON0_C4SP_SIZE                        equ 0001h
CM4CON0_C4SP_LENGTH                      equ 0001h
CM4CON0_C4SP_MASK                        equ 0004h
CM4CON0_C4ZLF_POSN                       equ 0003h
CM4CON0_C4ZLF_POSITION                   equ 0003h
CM4CON0_C4ZLF_SIZE                       equ 0001h
CM4CON0_C4ZLF_LENGTH                     equ 0001h
CM4CON0_C4ZLF_MASK                       equ 0008h
CM4CON0_C4POL_POSN                       equ 0004h
CM4CON0_C4POL_POSITION                   equ 0004h
CM4CON0_C4POL_SIZE                       equ 0001h
CM4CON0_C4POL_LENGTH                     equ 0001h
CM4CON0_C4POL_MASK                       equ 0010h
CM4CON0_C4OUT_POSN                       equ 0006h
CM4CON0_C4OUT_POSITION                   equ 0006h
CM4CON0_C4OUT_SIZE                       equ 0001h
CM4CON0_C4OUT_LENGTH                     equ 0001h
CM4CON0_C4OUT_MASK                       equ 0040h
CM4CON0_C4ON_POSN                        equ 0007h
CM4CON0_C4ON_POSITION                    equ 0007h
CM4CON0_C4ON_SIZE                        equ 0001h
CM4CON0_C4ON_LENGTH                      equ 0001h
CM4CON0_C4ON_MASK                        equ 0080h

// Register: CM4CON1
#define CM4CON1 CM4CON1
CM4CON1                                  equ 090Dh
// bitfield definitions
CM4CON1_INTN_POSN                        equ 0000h
CM4CON1_INTN_POSITION                    equ 0000h
CM4CON1_INTN_SIZE                        equ 0001h
CM4CON1_INTN_LENGTH                      equ 0001h
CM4CON1_INTN_MASK                        equ 0001h
CM4CON1_INTP_POSN                        equ 0001h
CM4CON1_INTP_POSITION                    equ 0001h
CM4CON1_INTP_SIZE                        equ 0001h
CM4CON1_INTP_LENGTH                      equ 0001h
CM4CON1_INTP_MASK                        equ 0002h
CM4CON1_C4INTN_POSN                      equ 0000h
CM4CON1_C4INTN_POSITION                  equ 0000h
CM4CON1_C4INTN_SIZE                      equ 0001h
CM4CON1_C4INTN_LENGTH                    equ 0001h
CM4CON1_C4INTN_MASK                      equ 0001h
CM4CON1_C4INTP_POSN                      equ 0001h
CM4CON1_C4INTP_POSITION                  equ 0001h
CM4CON1_C4INTP_SIZE                      equ 0001h
CM4CON1_C4INTP_LENGTH                    equ 0001h
CM4CON1_C4INTP_MASK                      equ 0002h

// Register: CM4NSEL
#define CM4NSEL CM4NSEL
CM4NSEL                                  equ 090Eh
// bitfield definitions
CM4NSEL_NCH_POSN                         equ 0000h
CM4NSEL_NCH_POSITION                     equ 0000h
CM4NSEL_NCH_SIZE                         equ 0004h
CM4NSEL_NCH_LENGTH                       equ 0004h
CM4NSEL_NCH_MASK                         equ 000Fh
CM4NSEL_C4NCH_POSN                       equ 0000h
CM4NSEL_C4NCH_POSITION                   equ 0000h
CM4NSEL_C4NCH_SIZE                       equ 0004h
CM4NSEL_C4NCH_LENGTH                     equ 0004h
CM4NSEL_C4NCH_MASK                       equ 000Fh
CM4NSEL_C4NCH0_POSN                      equ 0000h
CM4NSEL_C4NCH0_POSITION                  equ 0000h
CM4NSEL_C4NCH0_SIZE                      equ 0001h
CM4NSEL_C4NCH0_LENGTH                    equ 0001h
CM4NSEL_C4NCH0_MASK                      equ 0001h
CM4NSEL_C4NCH1_POSN                      equ 0001h
CM4NSEL_C4NCH1_POSITION                  equ 0001h
CM4NSEL_C4NCH1_SIZE                      equ 0001h
CM4NSEL_C4NCH1_LENGTH                    equ 0001h
CM4NSEL_C4NCH1_MASK                      equ 0002h
CM4NSEL_C4NCH2_POSN                      equ 0002h
CM4NSEL_C4NCH2_POSITION                  equ 0002h
CM4NSEL_C4NCH2_SIZE                      equ 0001h
CM4NSEL_C4NCH2_LENGTH                    equ 0001h
CM4NSEL_C4NCH2_MASK                      equ 0004h
CM4NSEL_C4NCH3_POSN                      equ 0003h
CM4NSEL_C4NCH3_POSITION                  equ 0003h
CM4NSEL_C4NCH3_SIZE                      equ 0001h
CM4NSEL_C4NCH3_LENGTH                    equ 0001h
CM4NSEL_C4NCH3_MASK                      equ 0008h

// Register: CM4PSEL
#define CM4PSEL CM4PSEL
CM4PSEL                                  equ 090Fh
// bitfield definitions
CM4PSEL_PCH_POSN                         equ 0000h
CM4PSEL_PCH_POSITION                     equ 0000h
CM4PSEL_PCH_SIZE                         equ 0004h
CM4PSEL_PCH_LENGTH                       equ 0004h
CM4PSEL_PCH_MASK                         equ 000Fh
CM4PSEL_PCH0_POSN                        equ 0000h
CM4PSEL_PCH0_POSITION                    equ 0000h
CM4PSEL_PCH0_SIZE                        equ 0001h
CM4PSEL_PCH0_LENGTH                      equ 0001h
CM4PSEL_PCH0_MASK                        equ 0001h
CM4PSEL_PCH1_POSN                        equ 0001h
CM4PSEL_PCH1_POSITION                    equ 0001h
CM4PSEL_PCH1_SIZE                        equ 0001h
CM4PSEL_PCH1_LENGTH                      equ 0001h
CM4PSEL_PCH1_MASK                        equ 0002h
CM4PSEL_PCH2_POSN                        equ 0002h
CM4PSEL_PCH2_POSITION                    equ 0002h
CM4PSEL_PCH2_SIZE                        equ 0001h
CM4PSEL_PCH2_LENGTH                      equ 0001h
CM4PSEL_PCH2_MASK                        equ 0004h
CM4PSEL_PCH3_POSN                        equ 0003h
CM4PSEL_PCH3_POSITION                    equ 0003h
CM4PSEL_PCH3_SIZE                        equ 0001h
CM4PSEL_PCH3_LENGTH                      equ 0001h
CM4PSEL_PCH3_MASK                        equ 0008h
CM4PSEL_C4PCH_POSN                       equ 0000h
CM4PSEL_C4PCH_POSITION                   equ 0000h
CM4PSEL_C4PCH_SIZE                       equ 0004h
CM4PSEL_C4PCH_LENGTH                     equ 0004h
CM4PSEL_C4PCH_MASK                       equ 000Fh
CM4PSEL_C4PCH0_POSN                      equ 0000h
CM4PSEL_C4PCH0_POSITION                  equ 0000h
CM4PSEL_C4PCH0_SIZE                      equ 0001h
CM4PSEL_C4PCH0_LENGTH                    equ 0001h
CM4PSEL_C4PCH0_MASK                      equ 0001h
CM4PSEL_C4PCH1_POSN                      equ 0001h
CM4PSEL_C4PCH1_POSITION                  equ 0001h
CM4PSEL_C4PCH1_SIZE                      equ 0001h
CM4PSEL_C4PCH1_LENGTH                    equ 0001h
CM4PSEL_C4PCH1_MASK                      equ 0002h
CM4PSEL_C4PCH2_POSN                      equ 0002h
CM4PSEL_C4PCH2_POSITION                  equ 0002h
CM4PSEL_C4PCH2_SIZE                      equ 0001h
CM4PSEL_C4PCH2_LENGTH                    equ 0001h
CM4PSEL_C4PCH2_MASK                      equ 0004h
CM4PSEL_C4PCH3_POSN                      equ 0003h
CM4PSEL_C4PCH3_POSITION                  equ 0003h
CM4PSEL_C4PCH3_SIZE                      equ 0001h
CM4PSEL_C4PCH3_LENGTH                    equ 0001h
CM4PSEL_C4PCH3_MASK                      equ 0008h

// Register: CM5CON0
#define CM5CON0 CM5CON0
CM5CON0                                  equ 0910h
// bitfield definitions
CM5CON0_SYNC_POSN                        equ 0000h
CM5CON0_SYNC_POSITION                    equ 0000h
CM5CON0_SYNC_SIZE                        equ 0001h
CM5CON0_SYNC_LENGTH                      equ 0001h
CM5CON0_SYNC_MASK                        equ 0001h
CM5CON0_HYS_POSN                         equ 0001h
CM5CON0_HYS_POSITION                     equ 0001h
CM5CON0_HYS_SIZE                         equ 0001h
CM5CON0_HYS_LENGTH                       equ 0001h
CM5CON0_HYS_MASK                         equ 0002h
CM5CON0_ZLF_POSN                         equ 0003h
CM5CON0_ZLF_POSITION                     equ 0003h
CM5CON0_ZLF_SIZE                         equ 0001h
CM5CON0_ZLF_LENGTH                       equ 0001h
CM5CON0_ZLF_MASK                         equ 0008h
CM5CON0_POL_POSN                         equ 0004h
CM5CON0_POL_POSITION                     equ 0004h
CM5CON0_POL_SIZE                         equ 0001h
CM5CON0_POL_LENGTH                       equ 0001h
CM5CON0_POL_MASK                         equ 0010h
CM5CON0_OUT_POSN                         equ 0006h
CM5CON0_OUT_POSITION                     equ 0006h
CM5CON0_OUT_SIZE                         equ 0001h
CM5CON0_OUT_LENGTH                       equ 0001h
CM5CON0_OUT_MASK                         equ 0040h
CM5CON0_ON_POSN                          equ 0007h
CM5CON0_ON_POSITION                      equ 0007h
CM5CON0_ON_SIZE                          equ 0001h
CM5CON0_ON_LENGTH                        equ 0001h
CM5CON0_ON_MASK                          equ 0080h
CM5CON0_C5SYNC_POSN                      equ 0000h
CM5CON0_C5SYNC_POSITION                  equ 0000h
CM5CON0_C5SYNC_SIZE                      equ 0001h
CM5CON0_C5SYNC_LENGTH                    equ 0001h
CM5CON0_C5SYNC_MASK                      equ 0001h
CM5CON0_C5HYS_POSN                       equ 0001h
CM5CON0_C5HYS_POSITION                   equ 0001h
CM5CON0_C5HYS_SIZE                       equ 0001h
CM5CON0_C5HYS_LENGTH                     equ 0001h
CM5CON0_C5HYS_MASK                       equ 0002h
CM5CON0_C5SP_POSN                        equ 0002h
CM5CON0_C5SP_POSITION                    equ 0002h
CM5CON0_C5SP_SIZE                        equ 0001h
CM5CON0_C5SP_LENGTH                      equ 0001h
CM5CON0_C5SP_MASK                        equ 0004h
CM5CON0_C5ZLF_POSN                       equ 0003h
CM5CON0_C5ZLF_POSITION                   equ 0003h
CM5CON0_C5ZLF_SIZE                       equ 0001h
CM5CON0_C5ZLF_LENGTH                     equ 0001h
CM5CON0_C5ZLF_MASK                       equ 0008h
CM5CON0_C5POL_POSN                       equ 0004h
CM5CON0_C5POL_POSITION                   equ 0004h
CM5CON0_C5POL_SIZE                       equ 0001h
CM5CON0_C5POL_LENGTH                     equ 0001h
CM5CON0_C5POL_MASK                       equ 0010h
CM5CON0_C5OUT_POSN                       equ 0006h
CM5CON0_C5OUT_POSITION                   equ 0006h
CM5CON0_C5OUT_SIZE                       equ 0001h
CM5CON0_C5OUT_LENGTH                     equ 0001h
CM5CON0_C5OUT_MASK                       equ 0040h
CM5CON0_C5ON_POSN                        equ 0007h
CM5CON0_C5ON_POSITION                    equ 0007h
CM5CON0_C5ON_SIZE                        equ 0001h
CM5CON0_C5ON_LENGTH                      equ 0001h
CM5CON0_C5ON_MASK                        equ 0080h

// Register: CM5CON1
#define CM5CON1 CM5CON1
CM5CON1                                  equ 0911h
// bitfield definitions
CM5CON1_INTN_POSN                        equ 0000h
CM5CON1_INTN_POSITION                    equ 0000h
CM5CON1_INTN_SIZE                        equ 0001h
CM5CON1_INTN_LENGTH                      equ 0001h
CM5CON1_INTN_MASK                        equ 0001h
CM5CON1_INTP_POSN                        equ 0001h
CM5CON1_INTP_POSITION                    equ 0001h
CM5CON1_INTP_SIZE                        equ 0001h
CM5CON1_INTP_LENGTH                      equ 0001h
CM5CON1_INTP_MASK                        equ 0002h
CM5CON1_C5INTN_POSN                      equ 0000h
CM5CON1_C5INTN_POSITION                  equ 0000h
CM5CON1_C5INTN_SIZE                      equ 0001h
CM5CON1_C5INTN_LENGTH                    equ 0001h
CM5CON1_C5INTN_MASK                      equ 0001h
CM5CON1_C5INTP_POSN                      equ 0001h
CM5CON1_C5INTP_POSITION                  equ 0001h
CM5CON1_C5INTP_SIZE                      equ 0001h
CM5CON1_C5INTP_LENGTH                    equ 0001h
CM5CON1_C5INTP_MASK                      equ 0002h

// Register: CM5NSEL
#define CM5NSEL CM5NSEL
CM5NSEL                                  equ 0912h
// bitfield definitions
CM5NSEL_NCH_POSN                         equ 0000h
CM5NSEL_NCH_POSITION                     equ 0000h
CM5NSEL_NCH_SIZE                         equ 0004h
CM5NSEL_NCH_LENGTH                       equ 0004h
CM5NSEL_NCH_MASK                         equ 000Fh
CM5NSEL_C5NCH_POSN                       equ 0000h
CM5NSEL_C5NCH_POSITION                   equ 0000h
CM5NSEL_C5NCH_SIZE                       equ 0004h
CM5NSEL_C5NCH_LENGTH                     equ 0004h
CM5NSEL_C5NCH_MASK                       equ 000Fh
CM5NSEL_C5NCH0_POSN                      equ 0000h
CM5NSEL_C5NCH0_POSITION                  equ 0000h
CM5NSEL_C5NCH0_SIZE                      equ 0001h
CM5NSEL_C5NCH0_LENGTH                    equ 0001h
CM5NSEL_C5NCH0_MASK                      equ 0001h
CM5NSEL_C5NCH1_POSN                      equ 0001h
CM5NSEL_C5NCH1_POSITION                  equ 0001h
CM5NSEL_C5NCH1_SIZE                      equ 0001h
CM5NSEL_C5NCH1_LENGTH                    equ 0001h
CM5NSEL_C5NCH1_MASK                      equ 0002h
CM5NSEL_C5NCH2_POSN                      equ 0002h
CM5NSEL_C5NCH2_POSITION                  equ 0002h
CM5NSEL_C5NCH2_SIZE                      equ 0001h
CM5NSEL_C5NCH2_LENGTH                    equ 0001h
CM5NSEL_C5NCH2_MASK                      equ 0004h
CM5NSEL_C5NCH3_POSN                      equ 0003h
CM5NSEL_C5NCH3_POSITION                  equ 0003h
CM5NSEL_C5NCH3_SIZE                      equ 0001h
CM5NSEL_C5NCH3_LENGTH                    equ 0001h
CM5NSEL_C5NCH3_MASK                      equ 0008h

// Register: CM5PSEL
#define CM5PSEL CM5PSEL
CM5PSEL                                  equ 0913h
// bitfield definitions
CM5PSEL_PCH_POSN                         equ 0000h
CM5PSEL_PCH_POSITION                     equ 0000h
CM5PSEL_PCH_SIZE                         equ 0004h
CM5PSEL_PCH_LENGTH                       equ 0004h
CM5PSEL_PCH_MASK                         equ 000Fh
CM5PSEL_PCH0_POSN                        equ 0000h
CM5PSEL_PCH0_POSITION                    equ 0000h
CM5PSEL_PCH0_SIZE                        equ 0001h
CM5PSEL_PCH0_LENGTH                      equ 0001h
CM5PSEL_PCH0_MASK                        equ 0001h
CM5PSEL_PCH1_POSN                        equ 0001h
CM5PSEL_PCH1_POSITION                    equ 0001h
CM5PSEL_PCH1_SIZE                        equ 0001h
CM5PSEL_PCH1_LENGTH                      equ 0001h
CM5PSEL_PCH1_MASK                        equ 0002h
CM5PSEL_PCH2_POSN                        equ 0002h
CM5PSEL_PCH2_POSITION                    equ 0002h
CM5PSEL_PCH2_SIZE                        equ 0001h
CM5PSEL_PCH2_LENGTH                      equ 0001h
CM5PSEL_PCH2_MASK                        equ 0004h
CM5PSEL_PCH3_POSN                        equ 0003h
CM5PSEL_PCH3_POSITION                    equ 0003h
CM5PSEL_PCH3_SIZE                        equ 0001h
CM5PSEL_PCH3_LENGTH                      equ 0001h
CM5PSEL_PCH3_MASK                        equ 0008h
CM5PSEL_C5PCH_POSN                       equ 0000h
CM5PSEL_C5PCH_POSITION                   equ 0000h
CM5PSEL_C5PCH_SIZE                       equ 0004h
CM5PSEL_C5PCH_LENGTH                     equ 0004h
CM5PSEL_C5PCH_MASK                       equ 000Fh
CM5PSEL_C5PCH0_POSN                      equ 0000h
CM5PSEL_C5PCH0_POSITION                  equ 0000h
CM5PSEL_C5PCH0_SIZE                      equ 0001h
CM5PSEL_C5PCH0_LENGTH                    equ 0001h
CM5PSEL_C5PCH0_MASK                      equ 0001h
CM5PSEL_C5PCH1_POSN                      equ 0001h
CM5PSEL_C5PCH1_POSITION                  equ 0001h
CM5PSEL_C5PCH1_SIZE                      equ 0001h
CM5PSEL_C5PCH1_LENGTH                    equ 0001h
CM5PSEL_C5PCH1_MASK                      equ 0002h
CM5PSEL_C5PCH2_POSN                      equ 0002h
CM5PSEL_C5PCH2_POSITION                  equ 0002h
CM5PSEL_C5PCH2_SIZE                      equ 0001h
CM5PSEL_C5PCH2_LENGTH                    equ 0001h
CM5PSEL_C5PCH2_MASK                      equ 0004h
CM5PSEL_C5PCH3_POSN                      equ 0003h
CM5PSEL_C5PCH3_POSITION                  equ 0003h
CM5PSEL_C5PCH3_SIZE                      equ 0001h
CM5PSEL_C5PCH3_LENGTH                    equ 0001h
CM5PSEL_C5PCH3_MASK                      equ 0008h

