GopalSaraf/Practicals/PSDL/include/proc/pic16lf1773.inc
// Register: PWM6TMRL
#define PWM6TMRL PWM6TMRL
PWM6TMRL                                 equ 0DA9h
// bitfield definitions
PWM6TMRL_TMR_POSN                        equ 0000h
PWM6TMRL_TMR_POSITION                    equ 0000h
PWM6TMRL_TMR_SIZE                        equ 0008h
PWM6TMRL_TMR_LENGTH                      equ 0008h
PWM6TMRL_TMR_MASK                        equ 00FFh
PWM6TMRL_PWM6TMRL0_POSN                  equ 0000h
PWM6TMRL_PWM6TMRL0_POSITION              equ 0000h
PWM6TMRL_PWM6TMRL0_SIZE                  equ 0001h
PWM6TMRL_PWM6TMRL0_LENGTH                equ 0001h
PWM6TMRL_PWM6TMRL0_MASK                  equ 0001h
PWM6TMRL_PWM6TMRL1_POSN                  equ 0001h
PWM6TMRL_PWM6TMRL1_POSITION              equ 0001h
PWM6TMRL_PWM6TMRL1_SIZE                  equ 0001h
PWM6TMRL_PWM6TMRL1_LENGTH                equ 0001h
PWM6TMRL_PWM6TMRL1_MASK                  equ 0002h
PWM6TMRL_PWM6TMRL2_POSN                  equ 0002h
PWM6TMRL_PWM6TMRL2_POSITION              equ 0002h
PWM6TMRL_PWM6TMRL2_SIZE                  equ 0001h
PWM6TMRL_PWM6TMRL2_LENGTH                equ 0001h
PWM6TMRL_PWM6TMRL2_MASK                  equ 0004h
PWM6TMRL_PWM6TMRL3_POSN                  equ 0003h
PWM6TMRL_PWM6TMRL3_POSITION              equ 0003h
PWM6TMRL_PWM6TMRL3_SIZE                  equ 0001h
PWM6TMRL_PWM6TMRL3_LENGTH                equ 0001h
PWM6TMRL_PWM6TMRL3_MASK                  equ 0008h
PWM6TMRL_PWM6TMRL4_POSN                  equ 0004h
PWM6TMRL_PWM6TMRL4_POSITION              equ 0004h
PWM6TMRL_PWM6TMRL4_SIZE                  equ 0001h
PWM6TMRL_PWM6TMRL4_LENGTH                equ 0001h
PWM6TMRL_PWM6TMRL4_MASK                  equ 0010h
PWM6TMRL_PWM6TMRL5_POSN                  equ 0005h
PWM6TMRL_PWM6TMRL5_POSITION              equ 0005h
PWM6TMRL_PWM6TMRL5_SIZE                  equ 0001h
PWM6TMRL_PWM6TMRL5_LENGTH                equ 0001h
PWM6TMRL_PWM6TMRL5_MASK                  equ 0020h
PWM6TMRL_PWM6TMRL6_POSN                  equ 0006h
PWM6TMRL_PWM6TMRL6_POSITION              equ 0006h
PWM6TMRL_PWM6TMRL6_SIZE                  equ 0001h
PWM6TMRL_PWM6TMRL6_LENGTH                equ 0001h
PWM6TMRL_PWM6TMRL6_MASK                  equ 0040h
PWM6TMRL_PWM6TMRL7_POSN                  equ 0007h
PWM6TMRL_PWM6TMRL7_POSITION              equ 0007h
PWM6TMRL_PWM6TMRL7_SIZE                  equ 0001h
PWM6TMRL_PWM6TMRL7_LENGTH                equ 0001h
PWM6TMRL_PWM6TMRL7_MASK                  equ 0080h
PWM6TMRL_PWM6TMRL_POSN                   equ 0000h
PWM6TMRL_PWM6TMRL_POSITION               equ 0000h
PWM6TMRL_PWM6TMRL_SIZE                   equ 0008h
PWM6TMRL_PWM6TMRL_LENGTH                 equ 0008h
PWM6TMRL_PWM6TMRL_MASK                   equ 00FFh

// Register: PWM6TMRH
#define PWM6TMRH PWM6TMRH
PWM6TMRH                                 equ 0DAAh
// bitfield definitions
PWM6TMRH_TMR_POSN                        equ 0000h
PWM6TMRH_TMR_POSITION                    equ 0000h
PWM6TMRH_TMR_SIZE                        equ 0008h
PWM6TMRH_TMR_LENGTH                      equ 0008h
PWM6TMRH_TMR_MASK                        equ 00FFh
PWM6TMRH_PWM6TMRH0_POSN                  equ 0000h
PWM6TMRH_PWM6TMRH0_POSITION              equ 0000h
PWM6TMRH_PWM6TMRH0_SIZE                  equ 0001h
PWM6TMRH_PWM6TMRH0_LENGTH                equ 0001h
PWM6TMRH_PWM6TMRH0_MASK                  equ 0001h
PWM6TMRH_PWM6TMRH1_POSN                  equ 0001h
PWM6TMRH_PWM6TMRH1_POSITION              equ 0001h
PWM6TMRH_PWM6TMRH1_SIZE                  equ 0001h
PWM6TMRH_PWM6TMRH1_LENGTH                equ 0001h
PWM6TMRH_PWM6TMRH1_MASK                  equ 0002h
PWM6TMRH_PWM6TMRH2_POSN                  equ 0002h
PWM6TMRH_PWM6TMRH2_POSITION              equ 0002h
PWM6TMRH_PWM6TMRH2_SIZE                  equ 0001h
PWM6TMRH_PWM6TMRH2_LENGTH                equ 0001h
PWM6TMRH_PWM6TMRH2_MASK                  equ 0004h
PWM6TMRH_PWM6TMRH3_POSN                  equ 0003h
PWM6TMRH_PWM6TMRH3_POSITION              equ 0003h
PWM6TMRH_PWM6TMRH3_SIZE                  equ 0001h
PWM6TMRH_PWM6TMRH3_LENGTH                equ 0001h
PWM6TMRH_PWM6TMRH3_MASK                  equ 0008h
PWM6TMRH_PWM6TMRH4_POSN                  equ 0004h
PWM6TMRH_PWM6TMRH4_POSITION              equ 0004h
PWM6TMRH_PWM6TMRH4_SIZE                  equ 0001h
PWM6TMRH_PWM6TMRH4_LENGTH                equ 0001h
PWM6TMRH_PWM6TMRH4_MASK                  equ 0010h
PWM6TMRH_PWM6TMRH5_POSN                  equ 0005h
PWM6TMRH_PWM6TMRH5_POSITION              equ 0005h
PWM6TMRH_PWM6TMRH5_SIZE                  equ 0001h
PWM6TMRH_PWM6TMRH5_LENGTH                equ 0001h
PWM6TMRH_PWM6TMRH5_MASK                  equ 0020h
PWM6TMRH_PWM6TMRH6_POSN                  equ 0006h
PWM6TMRH_PWM6TMRH6_POSITION              equ 0006h
PWM6TMRH_PWM6TMRH6_SIZE                  equ 0001h
PWM6TMRH_PWM6TMRH6_LENGTH                equ 0001h
PWM6TMRH_PWM6TMRH6_MASK                  equ 0040h
PWM6TMRH_PWM6TMRH7_POSN                  equ 0007h
PWM6TMRH_PWM6TMRH7_POSITION              equ 0007h
PWM6TMRH_PWM6TMRH7_SIZE                  equ 0001h
PWM6TMRH_PWM6TMRH7_LENGTH                equ 0001h
PWM6TMRH_PWM6TMRH7_MASK                  equ 0080h
PWM6TMRH_PWM6TMRH_POSN                   equ 0000h
PWM6TMRH_PWM6TMRH_POSITION               equ 0000h
PWM6TMRH_PWM6TMRH_SIZE                   equ 0008h
PWM6TMRH_PWM6TMRH_LENGTH                 equ 0008h
PWM6TMRH_PWM6TMRH_MASK                   equ 00FFh

// Register: PWM6CON
#define PWM6CON PWM6CON
PWM6CON                                  equ 0DABh
// bitfield definitions
PWM6CON_MODE_POSN                        equ 0002h
PWM6CON_MODE_POSITION                    equ 0002h
PWM6CON_MODE_SIZE                        equ 0002h
PWM6CON_MODE_LENGTH                      equ 0002h
PWM6CON_MODE_MASK                        equ 000Ch
PWM6CON_POL_POSN                         equ 0004h
PWM6CON_POL_POSITION                     equ 0004h
PWM6CON_POL_SIZE                         equ 0001h
PWM6CON_POL_LENGTH                       equ 0001h
PWM6CON_POL_MASK                         equ 0010h
PWM6CON_OUT_POSN                         equ 0005h
PWM6CON_OUT_POSITION                     equ 0005h
PWM6CON_OUT_SIZE                         equ 0001h
PWM6CON_OUT_LENGTH                       equ 0001h
PWM6CON_OUT_MASK                         equ 0020h
PWM6CON_EN_POSN                          equ 0007h
PWM6CON_EN_POSITION                      equ 0007h
PWM6CON_EN_SIZE                          equ 0001h
PWM6CON_EN_LENGTH                        equ 0001h
PWM6CON_EN_MASK                          equ 0080h
PWM6CON_PWM6MODE0_POSN                   equ 0002h
PWM6CON_PWM6MODE0_POSITION               equ 0002h
PWM6CON_PWM6MODE0_SIZE                   equ 0001h
PWM6CON_PWM6MODE0_LENGTH                 equ 0001h
PWM6CON_PWM6MODE0_MASK                   equ 0004h
PWM6CON_PWM6MODE1_POSN                   equ 0003h
PWM6CON_PWM6MODE1_POSITION               equ 0003h
PWM6CON_PWM6MODE1_SIZE                   equ 0001h
PWM6CON_PWM6MODE1_LENGTH                 equ 0001h
PWM6CON_PWM6MODE1_MASK                   equ 0008h
PWM6CON_PWM6MODE_POSN                    equ 0002h
PWM6CON_PWM6MODE_POSITION                equ 0002h
PWM6CON_PWM6MODE_SIZE                    equ 0002h
PWM6CON_PWM6MODE_LENGTH                  equ 0002h
PWM6CON_PWM6MODE_MASK                    equ 000Ch
PWM6CON_PWM6POL_POSN                     equ 0004h
PWM6CON_PWM6POL_POSITION                 equ 0004h
PWM6CON_PWM6POL_SIZE                     equ 0001h
PWM6CON_PWM6POL_LENGTH                   equ 0001h
PWM6CON_PWM6POL_MASK                     equ 0010h
PWM6CON_PWM6OUT_POSN                     equ 0005h
PWM6CON_PWM6OUT_POSITION                 equ 0005h
PWM6CON_PWM6OUT_SIZE                     equ 0001h
PWM6CON_PWM6OUT_LENGTH                   equ 0001h
PWM6CON_PWM6OUT_MASK                     equ 0020h
PWM6CON_PWM6EN_POSN                      equ 0007h
PWM6CON_PWM6EN_POSITION                  equ 0007h
PWM6CON_PWM6EN_SIZE                      equ 0001h
PWM6CON_PWM6EN_LENGTH                    equ 0001h
PWM6CON_PWM6EN_MASK                      equ 0080h
PWM6CON_MODE0_POSN                       equ 0002h
PWM6CON_MODE0_POSITION                   equ 0002h
PWM6CON_MODE0_SIZE                       equ 0001h
PWM6CON_MODE0_LENGTH                     equ 0001h
PWM6CON_MODE0_MASK                       equ 0004h
PWM6CON_MODE1_POSN                       equ 0003h
PWM6CON_MODE1_POSITION                   equ 0003h
PWM6CON_MODE1_SIZE                       equ 0001h
PWM6CON_MODE1_LENGTH                     equ 0001h
PWM6CON_MODE1_MASK                       equ 0008h

// Register: PWM6INTE
#define PWM6INTE PWM6INTE
PWM6INTE                                 equ 0DACh
// bitfield definitions
PWM6INTE_PRIE_POSN                       equ 0000h
PWM6INTE_PRIE_POSITION                   equ 0000h
PWM6INTE_PRIE_SIZE                       equ 0001h
PWM6INTE_PRIE_LENGTH                     equ 0001h
PWM6INTE_PRIE_MASK                       equ 0001h
PWM6INTE_DCIE_POSN                       equ 0001h
PWM6INTE_DCIE_POSITION                   equ 0001h
PWM6INTE_DCIE_SIZE                       equ 0001h
PWM6INTE_DCIE_LENGTH                     equ 0001h
PWM6INTE_DCIE_MASK                       equ 0002h
PWM6INTE_PHIE_POSN                       equ 0002h
PWM6INTE_PHIE_POSITION                   equ 0002h
PWM6INTE_PHIE_SIZE                       equ 0001h
PWM6INTE_PHIE_LENGTH                     equ 0001h
PWM6INTE_PHIE_MASK                       equ 0004h
PWM6INTE_OFIE_POSN                       equ 0003h
PWM6INTE_OFIE_POSITION                   equ 0003h
PWM6INTE_OFIE_SIZE                       equ 0001h
PWM6INTE_OFIE_LENGTH                     equ 0001h
PWM6INTE_OFIE_MASK                       equ 0008h
PWM6INTE_PWM6PRIE_POSN                   equ 0000h
PWM6INTE_PWM6PRIE_POSITION               equ 0000h
PWM6INTE_PWM6PRIE_SIZE                   equ 0001h
PWM6INTE_PWM6PRIE_LENGTH                 equ 0001h
PWM6INTE_PWM6PRIE_MASK                   equ 0001h
PWM6INTE_PWM6DCIE_POSN                   equ 0001h
PWM6INTE_PWM6DCIE_POSITION               equ 0001h
PWM6INTE_PWM6DCIE_SIZE                   equ 0001h
PWM6INTE_PWM6DCIE_LENGTH                 equ 0001h
PWM6INTE_PWM6DCIE_MASK                   equ 0002h
PWM6INTE_PWM6PHIE_POSN                   equ 0002h
PWM6INTE_PWM6PHIE_POSITION               equ 0002h
PWM6INTE_PWM6PHIE_SIZE                   equ 0001h
PWM6INTE_PWM6PHIE_LENGTH                 equ 0001h
PWM6INTE_PWM6PHIE_MASK                   equ 0004h
PWM6INTE_PWM6OFIE_POSN                   equ 0003h
PWM6INTE_PWM6OFIE_POSITION               equ 0003h
PWM6INTE_PWM6OFIE_SIZE                   equ 0001h
PWM6INTE_PWM6OFIE_LENGTH                 equ 0001h
PWM6INTE_PWM6OFIE_MASK                   equ 0008h

// Register: PWM6INTF
#define PWM6INTF PWM6INTF
PWM6INTF                                 equ 0DADh
// bitfield definitions
PWM6INTF_PRIF_POSN                       equ 0000h
PWM6INTF_PRIF_POSITION                   equ 0000h
PWM6INTF_PRIF_SIZE                       equ 0001h
PWM6INTF_PRIF_LENGTH                     equ 0001h
PWM6INTF_PRIF_MASK                       equ 0001h
PWM6INTF_DCIF_POSN                       equ 0001h
PWM6INTF_DCIF_POSITION                   equ 0001h
PWM6INTF_DCIF_SIZE                       equ 0001h
PWM6INTF_DCIF_LENGTH                     equ 0001h
PWM6INTF_DCIF_MASK                       equ 0002h
PWM6INTF_PHIF_POSN                       equ 0002h
PWM6INTF_PHIF_POSITION                   equ 0002h
PWM6INTF_PHIF_SIZE                       equ 0001h
PWM6INTF_PHIF_LENGTH                     equ 0001h
PWM6INTF_PHIF_MASK                       equ 0004h
PWM6INTF_OFIF_POSN                       equ 0003h
PWM6INTF_OFIF_POSITION                   equ 0003h
PWM6INTF_OFIF_SIZE                       equ 0001h
PWM6INTF_OFIF_LENGTH                     equ 0001h
PWM6INTF_OFIF_MASK                       equ 0008h
PWM6INTF_PWM6PRIF_POSN                   equ 0000h
PWM6INTF_PWM6PRIF_POSITION               equ 0000h
PWM6INTF_PWM6PRIF_SIZE                   equ 0001h
PWM6INTF_PWM6PRIF_LENGTH                 equ 0001h
PWM6INTF_PWM6PRIF_MASK                   equ 0001h
PWM6INTF_PWM6DCIF_POSN                   equ 0001h
PWM6INTF_PWM6DCIF_POSITION               equ 0001h
PWM6INTF_PWM6DCIF_SIZE                   equ 0001h
PWM6INTF_PWM6DCIF_LENGTH                 equ 0001h
PWM6INTF_PWM6DCIF_MASK                   equ 0002h
PWM6INTF_PWM6PHIF_POSN                   equ 0002h
PWM6INTF_PWM6PHIF_POSITION               equ 0002h
PWM6INTF_PWM6PHIF_SIZE                   equ 0001h
PWM6INTF_PWM6PHIF_LENGTH                 equ 0001h
PWM6INTF_PWM6PHIF_MASK                   equ 0004h
PWM6INTF_PWM6OFIF_POSN                   equ 0003h
PWM6INTF_PWM6OFIF_POSITION               equ 0003h
PWM6INTF_PWM6OFIF_SIZE                   equ 0001h
PWM6INTF_PWM6OFIF_LENGTH                 equ 0001h
PWM6INTF_PWM6OFIF_MASK                   equ 0008h

// Register: PWM6CLKCON
#define PWM6CLKCON PWM6CLKCON
PWM6CLKCON                               equ 0DAEh
// bitfield definitions
PWM6CLKCON_CS_POSN                       equ 0000h
PWM6CLKCON_CS_POSITION                   equ 0000h
PWM6CLKCON_CS_SIZE                       equ 0002h
PWM6CLKCON_CS_LENGTH                     equ 0002h
PWM6CLKCON_CS_MASK                       equ 0003h
PWM6CLKCON_PS_POSN                       equ 0004h
PWM6CLKCON_PS_POSITION                   equ 0004h
PWM6CLKCON_PS_SIZE                       equ 0003h
PWM6CLKCON_PS_LENGTH                     equ 0003h
PWM6CLKCON_PS_MASK                       equ 0070h
PWM6CLKCON_PWM6CS0_POSN                  equ 0000h
PWM6CLKCON_PWM6CS0_POSITION              equ 0000h
PWM6CLKCON_PWM6CS0_SIZE                  equ 0001h
PWM6CLKCON_PWM6CS0_LENGTH                equ 0001h
PWM6CLKCON_PWM6CS0_MASK                  equ 0001h
PWM6CLKCON_PWM6CS1_POSN                  equ 0001h
PWM6CLKCON_PWM6CS1_POSITION              equ 0001h
PWM6CLKCON_PWM6CS1_SIZE                  equ 0001h
PWM6CLKCON_PWM6CS1_LENGTH                equ 0001h
PWM6CLKCON_PWM6CS1_MASK                  equ 0002h
PWM6CLKCON_PWM6CS2_POSN                  equ 0002h
PWM6CLKCON_PWM6CS2_POSITION              equ 0002h
PWM6CLKCON_PWM6CS2_SIZE                  equ 0001h
PWM6CLKCON_PWM6CS2_LENGTH                equ 0001h
PWM6CLKCON_PWM6CS2_MASK                  equ 0004h
PWM6CLKCON_PWM6PS0_POSN                  equ 0004h
PWM6CLKCON_PWM6PS0_POSITION              equ 0004h
PWM6CLKCON_PWM6PS0_SIZE                  equ 0001h
PWM6CLKCON_PWM6PS0_LENGTH                equ 0001h
PWM6CLKCON_PWM6PS0_MASK                  equ 0010h
PWM6CLKCON_PWM6PS1_POSN                  equ 0005h
PWM6CLKCON_PWM6PS1_POSITION              equ 0005h
PWM6CLKCON_PWM6PS1_SIZE                  equ 0001h
PWM6CLKCON_PWM6PS1_LENGTH                equ 0001h
PWM6CLKCON_PWM6PS1_MASK                  equ 0020h
PWM6CLKCON_PWM6PS2_POSN                  equ 0006h
PWM6CLKCON_PWM6PS2_POSITION              equ 0006h
PWM6CLKCON_PWM6PS2_SIZE                  equ 0001h
PWM6CLKCON_PWM6PS2_LENGTH                equ 0001h
PWM6CLKCON_PWM6PS2_MASK                  equ 0040h
PWM6CLKCON_PWM6CS_POSN                   equ 0000h
PWM6CLKCON_PWM6CS_POSITION               equ 0000h
PWM6CLKCON_PWM6CS_SIZE                   equ 0003h
PWM6CLKCON_PWM6CS_LENGTH                 equ 0003h
PWM6CLKCON_PWM6CS_MASK                   equ 0007h
PWM6CLKCON_PWM6PS_POSN                   equ 0004h
PWM6CLKCON_PWM6PS_POSITION               equ 0004h
PWM6CLKCON_PWM6PS_SIZE                   equ 0003h
PWM6CLKCON_PWM6PS_LENGTH                 equ 0003h
PWM6CLKCON_PWM6PS_MASK                   equ 0070h
PWM6CLKCON_CS0_POSN                      equ 0000h
PWM6CLKCON_CS0_POSITION                  equ 0000h
PWM6CLKCON_CS0_SIZE                      equ 0001h
PWM6CLKCON_CS0_LENGTH                    equ 0001h
PWM6CLKCON_CS0_MASK                      equ 0001h
PWM6CLKCON_CS1_POSN                      equ 0001h
PWM6CLKCON_CS1_POSITION                  equ 0001h
PWM6CLKCON_CS1_SIZE                      equ 0001h
PWM6CLKCON_CS1_LENGTH                    equ 0001h
PWM6CLKCON_CS1_MASK                      equ 0002h
PWM6CLKCON_CS2_POSN                      equ 0002h
PWM6CLKCON_CS2_POSITION                  equ 0002h
PWM6CLKCON_CS2_SIZE                      equ 0001h
PWM6CLKCON_CS2_LENGTH                    equ 0001h
PWM6CLKCON_CS2_MASK                      equ 0004h
PWM6CLKCON_PS0_POSN                      equ 0004h
PWM6CLKCON_PS0_POSITION                  equ 0004h
PWM6CLKCON_PS0_SIZE                      equ 0001h
PWM6CLKCON_PS0_LENGTH                    equ 0001h
PWM6CLKCON_PS0_MASK                      equ 0010h
PWM6CLKCON_PS1_POSN                      equ 0005h
PWM6CLKCON_PS1_POSITION                  equ 0005h
PWM6CLKCON_PS1_SIZE                      equ 0001h
PWM6CLKCON_PS1_LENGTH                    equ 0001h
PWM6CLKCON_PS1_MASK                      equ 0020h
PWM6CLKCON_PS2_POSN                      equ 0006h
PWM6CLKCON_PS2_POSITION                  equ 0006h
PWM6CLKCON_PS2_SIZE                      equ 0001h
PWM6CLKCON_PS2_LENGTH                    equ 0001h
PWM6CLKCON_PS2_MASK                      equ 0040h

// Register: PWM6LDCON
#define PWM6LDCON PWM6LDCON
PWM6LDCON                                equ 0DAFh
// bitfield definitions
PWM6LDCON_LDS_POSN                       equ 0000h
PWM6LDCON_LDS_POSITION                   equ 0000h
PWM6LDCON_LDS_SIZE                       equ 0002h
PWM6LDCON_LDS_LENGTH                     equ 0002h
PWM6LDCON_LDS_MASK                       equ 0003h
PWM6LDCON_LDT_POSN                       equ 0006h
PWM6LDCON_LDT_POSITION                   equ 0006h
PWM6LDCON_LDT_SIZE                       equ 0001h
PWM6LDCON_LDT_LENGTH                     equ 0001h
PWM6LDCON_LDT_MASK                       equ 0040h
PWM6LDCON_LDA_POSN                       equ 0007h
PWM6LDCON_LDA_POSITION                   equ 0007h
PWM6LDCON_LDA_SIZE                       equ 0001h
PWM6LDCON_LDA_LENGTH                     equ 0001h
PWM6LDCON_LDA_MASK                       equ 0080h
PWM6LDCON_PWM6LDS0_POSN                  equ 0000h
PWM6LDCON_PWM6LDS0_POSITION              equ 0000h
PWM6LDCON_PWM6LDS0_SIZE                  equ 0001h
PWM6LDCON_PWM6LDS0_LENGTH                equ 0001h
PWM6LDCON_PWM6LDS0_MASK                  equ 0001h
PWM6LDCON_PWM6LDS1_POSN                  equ 0001h
PWM6LDCON_PWM6LDS1_POSITION              equ 0001h
PWM6LDCON_PWM6LDS1_SIZE                  equ 0001h
PWM6LDCON_PWM6LDS1_LENGTH                equ 0001h
PWM6LDCON_PWM6LDS1_MASK                  equ 0002h
PWM6LDCON_PWM6LDS_POSN                   equ 0000h
PWM6LDCON_PWM6LDS_POSITION               equ 0000h
PWM6LDCON_PWM6LDS_SIZE                   equ 0002h
PWM6LDCON_PWM6LDS_LENGTH                 equ 0002h
PWM6LDCON_PWM6LDS_MASK                   equ 0003h
PWM6LDCON_PWM6LDM_POSN                   equ 0006h
PWM6LDCON_PWM6LDM_POSITION               equ 0006h
PWM6LDCON_PWM6LDM_SIZE                   equ 0001h
PWM6LDCON_PWM6LDM_LENGTH                 equ 0001h
PWM6LDCON_PWM6LDM_MASK                   equ 0040h
PWM6LDCON_PWM6LD_POSN                    equ 0007h
PWM6LDCON_PWM6LD_POSITION                equ 0007h
PWM6LDCON_PWM6LD_SIZE                    equ 0001h
PWM6LDCON_PWM6LD_LENGTH                  equ 0001h
PWM6LDCON_PWM6LD_MASK                    equ 0080h
PWM6LDCON_LDS0_POSN                      equ 0000h
PWM6LDCON_LDS0_POSITION                  equ 0000h
PWM6LDCON_LDS0_SIZE                      equ 0001h
PWM6LDCON_LDS0_LENGTH                    equ 0001h
PWM6LDCON_LDS0_MASK                      equ 0001h
PWM6LDCON_LDS1_POSN                      equ 0001h
PWM6LDCON_LDS1_POSITION                  equ 0001h
PWM6LDCON_LDS1_SIZE                      equ 0001h
PWM6LDCON_LDS1_LENGTH                    equ 0001h
PWM6LDCON_LDS1_MASK                      equ 0002h

// Register: PWM6OFCON
#define PWM6OFCON PWM6OFCON
PWM6OFCON                                equ 0DB0h
// bitfield definitions
PWM6OFCON_OFS_POSN                       equ 0000h
PWM6OFCON_OFS_POSITION                   equ 0000h
PWM6OFCON_OFS_SIZE                       equ 0002h
PWM6OFCON_OFS_LENGTH                     equ 0002h
PWM6OFCON_OFS_MASK                       equ 0003h
PWM6OFCON_OFO_POSN                       equ 0004h
PWM6OFCON_OFO_POSITION                   equ 0004h
PWM6OFCON_OFO_SIZE                       equ 0001h
PWM6OFCON_OFO_LENGTH                     equ 0001h
PWM6OFCON_OFO_MASK                       equ 0010h
PWM6OFCON_OFM_POSN                       equ 0005h
PWM6OFCON_OFM_POSITION                   equ 0005h
PWM6OFCON_OFM_SIZE                       equ 0002h
PWM6OFCON_OFM_LENGTH                     equ 0002h
PWM6OFCON_OFM_MASK                       equ 0060h
PWM6OFCON_PWM6OFS0_POSN                  equ 0000h
PWM6OFCON_PWM6OFS0_POSITION              equ 0000h
PWM6OFCON_PWM6OFS0_SIZE                  equ 0001h
PWM6OFCON_PWM6OFS0_LENGTH                equ 0001h
PWM6OFCON_PWM6OFS0_MASK                  equ 0001h
PWM6OFCON_PWM6OFS1_POSN                  equ 0001h
PWM6OFCON_PWM6OFS1_POSITION              equ 0001h
PWM6OFCON_PWM6OFS1_SIZE                  equ 0001h
PWM6OFCON_PWM6OFS1_LENGTH                equ 0001h
PWM6OFCON_PWM6OFS1_MASK                  equ 0002h
PWM6OFCON_PWM6OFM0_POSN                  equ 0005h
PWM6OFCON_PWM6OFM0_POSITION              equ 0005h
PWM6OFCON_PWM6OFM0_SIZE                  equ 0001h
PWM6OFCON_PWM6OFM0_LENGTH                equ 0001h
PWM6OFCON_PWM6OFM0_MASK                  equ 0020h
PWM6OFCON_PWM6OFM1_POSN                  equ 0006h
PWM6OFCON_PWM6OFM1_POSITION              equ 0006h
PWM6OFCON_PWM6OFM1_SIZE                  equ 0001h
PWM6OFCON_PWM6OFM1_LENGTH                equ 0001h
PWM6OFCON_PWM6OFM1_MASK                  equ 0040h
PWM6OFCON_PWM6OFS_POSN                   equ 0000h
PWM6OFCON_PWM6OFS_POSITION               equ 0000h
PWM6OFCON_PWM6OFS_SIZE                   equ 0002h
PWM6OFCON_PWM6OFS_LENGTH                 equ 0002h
PWM6OFCON_PWM6OFS_MASK                   equ 0003h
PWM6OFCON_PWM6OFMC_POSN                  equ 0004h
PWM6OFCON_PWM6OFMC_POSITION              equ 0004h
PWM6OFCON_PWM6OFMC_SIZE                  equ 0001h
PWM6OFCON_PWM6OFMC_LENGTH                equ 0001h
PWM6OFCON_PWM6OFMC_MASK                  equ 0010h
PWM6OFCON_PWM6OFM_POSN                   equ 0005h
PWM6OFCON_PWM6OFM_POSITION               equ 0005h
PWM6OFCON_PWM6OFM_SIZE                   equ 0002h
PWM6OFCON_PWM6OFM_LENGTH                 equ 0002h
PWM6OFCON_PWM6OFM_MASK                   equ 0060h
PWM6OFCON_OFS0_POSN                      equ 0000h
PWM6OFCON_OFS0_POSITION                  equ 0000h
PWM6OFCON_OFS0_SIZE                      equ 0001h
PWM6OFCON_OFS0_LENGTH                    equ 0001h
PWM6OFCON_OFS0_MASK                      equ 0001h
PWM6OFCON_OFS1_POSN                      equ 0001h
PWM6OFCON_OFS1_POSITION                  equ 0001h
PWM6OFCON_OFS1_SIZE                      equ 0001h
PWM6OFCON_OFS1_LENGTH                    equ 0001h
PWM6OFCON_OFS1_MASK                      equ 0002h
PWM6OFCON_OFM0_POSN                      equ 0005h
PWM6OFCON_OFM0_POSITION                  equ 0005h
PWM6OFCON_OFM0_SIZE                      equ 0001h
PWM6OFCON_OFM0_LENGTH                    equ 0001h
PWM6OFCON_OFM0_MASK                      equ 0020h
PWM6OFCON_OFM1_POSN                      equ 0006h
PWM6OFCON_OFM1_POSITION                  equ 0006h
PWM6OFCON_OFM1_SIZE                      equ 0001h
PWM6OFCON_OFM1_LENGTH                    equ 0001h
PWM6OFCON_OFM1_MASK                      equ 0040h

