GopalSaraf/Practicals/PSDL/include/proc/pic16lf1773.inc
// Register: MD3CHPPS
#define MD3CHPPS MD3CHPPS
MD3CHPPS                                 equ 0E28h
// bitfield definitions
MD3CHPPS_MD3CHPPS_POSN                   equ 0000h
MD3CHPPS_MD3CHPPS_POSITION               equ 0000h
MD3CHPPS_MD3CHPPS_SIZE                   equ 0006h
MD3CHPPS_MD3CHPPS_LENGTH                 equ 0006h
MD3CHPPS_MD3CHPPS_MASK                   equ 003Fh

// Register: MD3MODPPS
#define MD3MODPPS MD3MODPPS
MD3MODPPS                                equ 0E29h
// bitfield definitions
MD3MODPPS_MD3MODPPS_POSN                 equ 0000h
MD3MODPPS_MD3MODPPS_POSITION             equ 0000h
MD3MODPPS_MD3MODPPS_SIZE                 equ 0006h
MD3MODPPS_MD3MODPPS_LENGTH               equ 0006h
MD3MODPPS_MD3MODPPS_MASK                 equ 003Fh

// Register: PRG1RPPS
#define PRG1RPPS PRG1RPPS
PRG1RPPS                                 equ 0E2Dh
// bitfield definitions
PRG1RPPS_PRG1RPPS_POSN                   equ 0000h
PRG1RPPS_PRG1RPPS_POSITION               equ 0000h
PRG1RPPS_PRG1RPPS_SIZE                   equ 0006h
PRG1RPPS_PRG1RPPS_LENGTH                 equ 0006h
PRG1RPPS_PRG1RPPS_MASK                   equ 003Fh

// Register: PRG1FPPS
#define PRG1FPPS PRG1FPPS
PRG1FPPS                                 equ 0E2Eh
// bitfield definitions
PRG1FPPS_PRG1FPPS_POSN                   equ 0000h
PRG1FPPS_PRG1FPPS_POSITION               equ 0000h
PRG1FPPS_PRG1FPPS_SIZE                   equ 0006h
PRG1FPPS_PRG1FPPS_LENGTH                 equ 0006h
PRG1FPPS_PRG1FPPS_MASK                   equ 003Fh

// Register: PRG2RPPS
#define PRG2RPPS PRG2RPPS
PRG2RPPS                                 equ 0E2Fh
// bitfield definitions
PRG2RPPS_PRG2RPPS_POSN                   equ 0000h
PRG2RPPS_PRG2RPPS_POSITION               equ 0000h
PRG2RPPS_PRG2RPPS_SIZE                   equ 0006h
PRG2RPPS_PRG2RPPS_LENGTH                 equ 0006h
PRG2RPPS_PRG2RPPS_MASK                   equ 003Fh

// Register: PRG2FPPS
#define PRG2FPPS PRG2FPPS
PRG2FPPS                                 equ 0E30h
// bitfield definitions
PRG2FPPS_PRG2FPPS_POSN                   equ 0000h
PRG2FPPS_PRG2FPPS_POSITION               equ 0000h
PRG2FPPS_PRG2FPPS_SIZE                   equ 0006h
PRG2FPPS_PRG2FPPS_LENGTH                 equ 0006h
PRG2FPPS_PRG2FPPS_MASK                   equ 003Fh

// Register: PRG3RPPS
#define PRG3RPPS PRG3RPPS
PRG3RPPS                                 equ 0E31h
// bitfield definitions
PRG3RPPS_PRG3RPPS_POSN                   equ 0000h
PRG3RPPS_PRG3RPPS_POSITION               equ 0000h
PRG3RPPS_PRG3RPPS_SIZE                   equ 0006h
PRG3RPPS_PRG3RPPS_LENGTH                 equ 0006h
PRG3RPPS_PRG3RPPS_MASK                   equ 003Fh

// Register: PRG3FPPS
#define PRG3FPPS PRG3FPPS
PRG3FPPS                                 equ 0E32h
// bitfield definitions
PRG3FPPS_PRG3FPPS_POSN                   equ 0000h
PRG3FPPS_PRG3FPPS_POSITION               equ 0000h
PRG3FPPS_PRG3FPPS_SIZE                   equ 0006h
PRG3FPPS_PRG3FPPS_LENGTH                 equ 0006h
PRG3FPPS_PRG3FPPS_MASK                   equ 003Fh

// Register: CLCIN0PPS
#define CLCIN0PPS CLCIN0PPS
CLCIN0PPS                                equ 0E35h
// bitfield definitions
CLCIN0PPS_CLCIN0PPS_POSN                 equ 0000h
CLCIN0PPS_CLCIN0PPS_POSITION             equ 0000h
CLCIN0PPS_CLCIN0PPS_SIZE                 equ 0006h
CLCIN0PPS_CLCIN0PPS_LENGTH               equ 0006h
CLCIN0PPS_CLCIN0PPS_MASK                 equ 003Fh

// Register: CLCIN1PPS
#define CLCIN1PPS CLCIN1PPS
CLCIN1PPS                                equ 0E36h
// bitfield definitions
CLCIN1PPS_CLCIN1PPS_POSN                 equ 0000h
CLCIN1PPS_CLCIN1PPS_POSITION             equ 0000h
CLCIN1PPS_CLCIN1PPS_SIZE                 equ 0006h
CLCIN1PPS_CLCIN1PPS_LENGTH               equ 0006h
CLCIN1PPS_CLCIN1PPS_MASK                 equ 003Fh

// Register: CLCIN2PPS
#define CLCIN2PPS CLCIN2PPS
CLCIN2PPS                                equ 0E37h
// bitfield definitions
CLCIN2PPS_CLCIN2PPS_POSN                 equ 0000h
CLCIN2PPS_CLCIN2PPS_POSITION             equ 0000h
CLCIN2PPS_CLCIN2PPS_SIZE                 equ 0006h
CLCIN2PPS_CLCIN2PPS_LENGTH               equ 0006h
CLCIN2PPS_CLCIN2PPS_MASK                 equ 003Fh

// Register: CLCIN3PPS
#define CLCIN3PPS CLCIN3PPS
CLCIN3PPS                                equ 0E38h
// bitfield definitions
CLCIN3PPS_CLCIN3PPS_POSN                 equ 0000h
CLCIN3PPS_CLCIN3PPS_POSITION             equ 0000h
CLCIN3PPS_CLCIN3PPS_SIZE                 equ 0006h
CLCIN3PPS_CLCIN3PPS_LENGTH               equ 0006h
CLCIN3PPS_CLCIN3PPS_MASK                 equ 003Fh

// Register: ADCACTPPS
#define ADCACTPPS ADCACTPPS
ADCACTPPS                                equ 0E39h
// bitfield definitions
ADCACTPPS_ADCACTPPS_POSN                 equ 0000h
ADCACTPPS_ADCACTPPS_POSITION             equ 0000h
ADCACTPPS_ADCACTPPS_SIZE                 equ 0006h
ADCACTPPS_ADCACTPPS_LENGTH               equ 0006h
ADCACTPPS_ADCACTPPS_MASK                 equ 003Fh

// Register: SSPCLKPPS
#define SSPCLKPPS SSPCLKPPS
SSPCLKPPS                                equ 0E3Ah
// bitfield definitions
SSPCLKPPS_SSPCLKPPS_POSN                 equ 0000h
SSPCLKPPS_SSPCLKPPS_POSITION             equ 0000h
SSPCLKPPS_SSPCLKPPS_SIZE                 equ 0006h
SSPCLKPPS_SSPCLKPPS_LENGTH               equ 0006h
SSPCLKPPS_SSPCLKPPS_MASK                 equ 003Fh

// Register: SSPDATPPS
#define SSPDATPPS SSPDATPPS
SSPDATPPS                                equ 0E3Bh
// bitfield definitions
SSPDATPPS_SSPDATPPS_POSN                 equ 0000h
SSPDATPPS_SSPDATPPS_POSITION             equ 0000h
SSPDATPPS_SSPDATPPS_SIZE                 equ 0006h
SSPDATPPS_SSPDATPPS_LENGTH               equ 0006h
SSPDATPPS_SSPDATPPS_MASK                 equ 003Fh

// Register: SSPSSPPS
#define SSPSSPPS SSPSSPPS
SSPSSPPS                                 equ 0E3Ch
// bitfield definitions
SSPSSPPS_SSPSSPPS_POSN                   equ 0000h
SSPSSPPS_SSPSSPPS_POSITION               equ 0000h
SSPSSPPS_SSPSSPPS_SIZE                   equ 0006h
SSPSSPPS_SSPSSPPS_LENGTH                 equ 0006h
SSPSSPPS_SSPSSPPS_MASK                   equ 003Fh

// Register: RXPPS
#define RXPPS RXPPS
RXPPS                                    equ 0E3Dh
// bitfield definitions
RXPPS_RXPPS_POSN                         equ 0000h
RXPPS_RXPPS_POSITION                     equ 0000h
RXPPS_RXPPS_SIZE                         equ 0006h
RXPPS_RXPPS_LENGTH                       equ 0006h
RXPPS_RXPPS_MASK                         equ 003Fh

